ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
//===-- RL78AsmParser.cpp - Parse RL78 assembly to MCInst instructions --===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
#include "MCTargetDesc/RL78MCExpr.h"
#include "MCTargetDesc/RL78MCTargetDesc.h"
#include "RL78.h"
#include "TargetInfo/RL78TargetInfo.h"
#include "llvm/ADT/STLExtras.h"
#include "llvm/ADT/SmallVector.h"
#include "llvm/ADT/StringRef.h"
#include "llvm/ADT/Triple.h"
#include "llvm/BinaryFormat/ELF.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCExpr.h"
#include "llvm/MC/MCSection.h"
#include "llvm/MC/MCSectionELF.h"
#include "llvm/MC/MCInst.h"
#include "llvm/MC/MCInstrInfo.h"
#include "llvm/MC/MCObjectFileInfo.h"
#include "llvm/MC/MCParser/MCAsmLexer.h"
#include "llvm/MC/MCParser/MCAsmParser.h"
#include "llvm/MC/MCParser/MCParsedAsmOperand.h"
#include "llvm/MC/MCParser/MCTargetAsmParser.h"
#include "llvm/MC/MCRegisterInfo.h"
#include "llvm/MC/MCStreamer.h"
#include "llvm/MC/MCSubtargetInfo.h"
#include "llvm/MC/MCSymbol.h"
#include "llvm/MC/MCValue.h"
#include "llvm/MC/TargetRegistry.h"
#include "llvm/Support/Casting.h"
#include "llvm/Support/Debug.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/Support/SMLoc.h"
#include "llvm/Support/raw_ostream.h"
#include <algorithm>
#include <cassert>
#include <cstdint>
#include <map>
#include <memory>
#include <set>
#include <sstream>
#include <regex>

using namespace llvm;
#define DEBUG_TYPE "rl78-asm-parser"

namespace {

class RL78Operand;

class RL78AsmParser : public MCTargetAsmParser {
  MCAsmParser &Parser;

  /// @name Auto-generated Match Functions
  /// {

#define GET_ASSEMBLER_HEADER
#include "RL78GenAsmMatcher.inc"

  /// }

  // Public interface of the MCTargetAsmParser.
  bool MatchAndEmitInstruction(SMLoc IDLoc, unsigned &Opcode,
                               OperandVector &Operands, MCStreamer &Out,
                               uint64_t &ErrorInfo,
                               bool MatchingInlineAsm) override;
  bool ParseRegister(unsigned &RegNo, SMLoc &StartLoc, SMLoc &EndLoc) override;
  OperandMatchResultTy tryParseRegister(unsigned &RegNo, SMLoc &StartLoc,
                                        SMLoc &EndLoc) override;

  bool ParseInstruction(ParseInstructionInfo &Info, StringRef Name,
                        SMLoc NameLoc, OperandVector &Operands) override;

  bool ParseDirective(AsmToken DirectiveID) override;

  unsigned validateTargetOperandClass(MCParsedAsmOperand &Op,
                                      unsigned Kind) override;

  const MCExpr *createTargetUnaryExpr(const MCExpr *E,
                                      AsmToken::TokenKind OperatorToken,
                                      MCContext &Ctx) override;

  int64_t getSymbolAliasValue(StringRef name);

  // Custom parse functions for RL78 specific operands.

  OperandMatchResultTy parseMEMOperand(OperandVector &Operands);
  OperandMatchResultTy parseStackSlotOperand(OperandVector &Operands);

  OperandMatchResultTy parseRegOffsetAddrOperand(OperandVector &Operands,
                                                 StringRef Mnemonic);
  OperandMatchResultTy parseRegOffsetAddrOperand(OperandVector &Operands);
  OperandMatchResultTy parseRegRegAddrOperand(OperandVector &Operands);

  OperandMatchResultTy parseEsRegRegRegOperand(OperandVector &Operands);
  OperandMatchResultTy RegBrackets(OperandVector &Operands, StringRef Mnemonic);
  OperandMatchResultTy parseEsRegRegAddrOperand(OperandVector &Operands);
  OperandMatchResultTy parseEsRegRegAddrAndDotOperand(OperandVector &Operands,
                                                      StringRef Mnemonic);
  OperandMatchResultTy parseOperand(OperandVector &Operands, StringRef Name);

  bool tryParseBCCorSCC(OperandVector &Operands, StringRef Name, SMLoc NameLoc);

  OperandMatchResultTy ParseOpeandRBx(OperandVector &Operands);

  OperandMatchResultTy ParseRegister(OperandVector &Operands,
                                     StringRef Mnemonic);
   
  OperandMatchResultTy parseDotIncludingOperand(OperandVector &Operands,
                                                StringRef Mnemonic);

  OperandMatchResultTy ParseShiftIntegerOperand(OperandVector &Operands,
                                                StringRef Mnemonic);

  bool searchSymbolAlias(StringRef name, unsigned &RegNo, unsigned &RegKind);

  /// Returns true if Tok is matched to a register and returns register in
  /// RegNo.
  bool matchRegisterName(const AsmToken &Tok, unsigned &RegNo,
                         unsigned &RegKind);
  bool matchRegisterNameByName(StringRef name, unsigned &RegNo,
                               unsigned &RegKind);

  bool is64Bit() const { return false; }

private:
  struct RelocationAttributeDefault {
    StringRef DefaultSectionName;
    unsigned Type = ELF::SHT_PROGBITS;
    unsigned Flags = ELF::SHF_ALLOC | ELF::SHF_EXECINSTR;
    unsigned DefaultAlign;
    bool AllowAlignAttribute;
    StringRef ShortDirective;
  };

  struct MacroLocalDefinitionRange {
    size_t Start;
    size_t End;
  };

  StringMap<RelocationAttributeDefault> RelocationAttributeMap;
  StringMap<std::string> MacroBodies;
  
  void InitializeRelocationAttributeMap();
  bool parseDirectiveSymbolAttribute(MCSymbolAttr Attr);
  bool parseIdentifier(StringRef &Res);
  void eatToEndOfStatement();
  bool eatSpacesTillEndOfLine();
  bool ParseSectionName(StringRef &SectionName);
  void SwitchToSection(StringRef NewSectionName, unsigned Type, unsigned Flags);
  bool LookupRelocationAttribute(
      StringRef SectionName, StringRef Attribute,
      RelocationAttributeDefault **RelocationAttributeDesc);
  bool ParseSectionArguments(SMLoc loc);
  bool parseDirectiveSeg(StringRef Name, StringRef Type);
  bool ParseDirectiveOrg();
  bool ParseDirectiveOffset();
  bool EmitSectionDirective(
      StringRef SectionName, StringRef RelocationAttribute,
      const RelocationAttributeDefault* RelocationAttributeDesc);
  bool ParseSectionAddress(std::string SectionName,
                           std::string &NewSectionName);
  bool checkForValidSection();
  bool parseDirectiveValue(StringRef IDVal, unsigned Size);
  bool parseDSDirective();
  bool parseDirectiveAlign();
  bool parseDirectiveMacro(StringRef Name);
  bool parseMacroLocalSymbols(StringMap<std::string> &MacroLocalSymbols);
  std::string ReplaceMacroLocalSymbols(
      std::string MacroBody, StringMap<std::string> &MacroLocalSymbols,
      SmallVector<MacroLocalDefinitionRange, 10> &MacroLocalSymbolRanges);
  bool SplitBitPosition(std::string *AddressSymbol, int64_t *AddressValue,
                        int64_t *BitPosition, bool *IsSymAddress,
                        std::string *ErrorMsg);
  bool parseDirectiveSet(StringRef Name);
  bool parseDirectiveEqu(StringRef Name);
  bool parseDirectiveVector(StringRef Name);
  bool HasTargetSubExpressionKind(const MCExpr *Expr,
                                  unsigned TargetExpressionKind);

