ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  // Parsed, but ignored directives
  bool parseDirectiveLine();
  bool parseDirectiveLineTopEnd();
  bool parseDirectiveStack();
  bool parseDirectiveType();

public:
  RL78AsmParser(const MCSubtargetInfo &sti, MCAsmParser &parser,
                const MCInstrInfo &MII, const MCTargetOptions &Options)
      : MCTargetAsmParser(Options, sti, MII), Parser(parser) {
    // Initialize the set of available features.
    setAvailableFeatures(ComputeAvailableFeatures(getSTI().getFeatureBits()));
	InitializeRelocationAttributeMap();
  }

  ~RL78AsmParser() override;
};

} // end anonymous namespace

static constexpr const char *BitPositionSymbolPrefix = ".$$$";

static const MCPhysReg IntRegs[32] = {
    RL78::R0,  RL78::R1,  RL78::R2,  RL78::R3,  RL78::R4,  RL78::R5,  RL78::R6,
    RL78::R7,  RL78::R8,  RL78::R9,  RL78::R10, RL78::R11, RL78::R12, RL78::R13,
    RL78::R14, RL78::R15, RL78::R16, RL78::R17, RL78::R18, RL78::R19, RL78::R20,
    RL78::R21, RL78::R22, RL78::R23, RL78::R24, RL78::R25, RL78::R26, RL78::R27,
    RL78::R28, RL78::R29, RL78::R30, RL78::R31};

namespace {

/// RL78Operand - Instances of this class represent a parsed RL78 machine
/// instruction.
class RL78Operand : public MCParsedAsmOperand {
public:
  enum RegisterKind {
    rk_None,
    rk_Reg,
    rk_RegPair,
  };

private:
  enum KindTy {
    k_Token,
    k_Register,
    k_Immediate,
    k_cc,
    k_Imm07,
    k_Imm17,
    k_Imm115,
    k_selrbx,
    k_Abs16,
    k_Abs8,
    k_Abs5,
    k_Abs20,
    k_MemoryReg,
    k_MemoryImm,
    k_STACKSlot,
    k_RegOffsetAddr,
    k_RegBorCOffsetAddr,
    k_RegRegAddr,
    k_EsRegRegReg,
    k_HLAddr,
    k_EsRegRegAddr,
    k_EsRegBorCRegAddr,
    k_EsHlRegAddr,
    k_brtargetRel8,
    k_brtargetRel16,
    k_brtargetAbs16,
    k_sfr,
    k_sfrp,
    k_EsAddr16
  } Kind;

  SMLoc StartLoc, EndLoc;

  struct Token {
    const char *Data;
    unsigned Length;
  };

  struct RegOp {
    unsigned RegNum;
    RegisterKind Kind;
  };

  struct RegRegAddrOp {
    RegOp RPReg;
    RegOp Reg;
  };

  struct EsRegRegRegOp {
    RegOp ESReg;
    RegOp RPReg;
    RegOp Reg;
  };

  struct STACKSlotNoOp {
    RegOp SPreg;
    const MCExpr *Val;
  };

  struct RegOffsetAddrOp {
    RegOp RPReg;
    const MCExpr *Val;
  };

  struct RegBorCOffsetAddrOp {
    RegOp Reg;
    const MCExpr *Val;
  };

  struct HLAddrOp {
    RegOp HlReg;
  };

  struct EsRegRegAddrOp {
    RegOp ESReg;
    RegOp RPReg;
    const MCExpr *Val;
  };
  struct EsRegBorCRegAddrOp {
    RegOp ESReg;
    RegOp Reg;
    const MCExpr *Val;
  };
  struct EsHlRegAddrOp {
    RegOp RL78RegES;
    RegOp RL78HL;
  };

  struct ImmOp {
    const MCExpr *Val;
  };

  struct Abs16Op {
    const MCExpr *Val;
  };
  struct Abs8Op {
    const MCExpr *Val;
  };

  struct Abs5Op {
    const MCExpr *Val;
  };

  struct Abs20Op {
    const MCExpr *Val;
  };

  struct Rel8Op {
    const MCExpr *Val;
  };

  struct Rel16Op {
    const MCExpr *Val;
  };

  struct brtargetAbs16Op {
    const MCExpr *Val;
  };

  struct brtargetRel8Op {
    const MCExpr *Val;
  };
  struct brtargetRel16Op {
    const MCExpr *Val;
  };

  struct sfrOp {
    const MCExpr *Val;
  };
  struct sfrpOp {
    const MCExpr *Val;
  };

  struct CCOp {
    const MCExpr *Val;
  };
  struct Imm07Op {
    const MCExpr *Val;
  };
  struct Imm17Op {
    const MCExpr *Val;
  };
  struct Imm115Op {
    const MCExpr *Val;
  };
  struct SELRBxOp {
    const MCExpr *Val;
  };

  struct EsAddr16Op {
    RegOp ESReg;
    const MCExpr *Val;
  };

  struct MemOp {
    unsigned Base;
    unsigned OffsetReg;
    const MCExpr *Off;
  };

  union {
    struct Token Tok;
    struct RegOp Reg;
    struct ImmOp Imm;
    struct MemOp Mem;
    struct Abs5Op Abs5;
    struct Abs8Op Abs8;
    struct Abs16Op Abs16;
    struct Abs20Op Abs20;
    struct brtargetRel8Op brtargetRel8;
    struct brtargetRel16Op brtargetRel16;
    struct brtargetAbs16Op brtargetAbs16;
    struct STACKSlotNoOp STACKSlotNo;
    struct RegRegAddrOp RegRegAddr;
    struct RegOffsetAddrOp RegOffsetAddr;
    struct RegBorCOffsetAddrOp RegBorCOffsetAddr;
    struct EsRegRegAddrOp EsRegRegAddr;
    struct EsHlRegAddrOp EsHlRegAddr;
    struct HLAddrOp HLAddr;
    struct sfrOp sfr;
    struct sfrpOp sfrp;
    struct EsAddr16Op EsAddr16;
    struct EsRegRegRegOp EsRegRegReg;
    struct EsRegBorCRegAddrOp EsRegBorCRegAddr;
    struct SELRBxOp SELRBx;
    struct Imm07Op Imm07;
    struct Imm17Op Imm17;
    struct Imm115Op Imm115;
    struct CCOp CC;
  };

public:
  RL78Operand(KindTy K) : MCParsedAsmOperand(), Kind(K) {}
  bool isABS5() { return Kind == k_Abs5; }
  bool isABS8() { return Kind == k_Abs8; }
  bool isCCOp() { return Kind == k_cc; }
  bool isSELRBx() { return Kind == k_selrbx; }
  bool isABS16() { return Kind == k_Abs16; }
  bool isABS20() { return Kind == k_Abs20; }
  bool isbrtargetRel8() { return Kind == k_brtargetRel8; }
  bool isbrtargetRel16() { return Kind == k_brtargetRel16; }
  bool isbrtargetAbs16() { return Kind == k_brtargetAbs16; }
  bool isToken() const override { return Kind == k_Token; }
  bool isReg() const override { return Kind == k_Register; }
  bool isImm() const override { return Kind == k_Immediate; }
  bool isImm07() const { return Kind == k_Imm07; }
  bool isImm17() const { return Kind == k_Imm17; }
  bool isImm115() const { return Kind == k_Imm115; }

  bool isMem() const override { return isMEMrr() || isMEMri(); }
  bool isMEMrr() const { return Kind == k_MemoryReg; }
  bool isMEMri() const { return Kind == k_MemoryImm; }

  bool isSTACKSlotNo() const { return Kind == k_STACKSlot; }
  bool isRegOffsetAddr() const { return Kind == k_RegOffsetAddr; }
  bool isRegBorCOffsetAddr() const { return Kind == k_RegBorCOffsetAddr; }
  bool isRegRegAddr() const { return Kind == k_RegRegAddr; }
  bool isEsRegRegReg() const { return Kind == k_EsRegRegReg; }
  bool isEsRegBorCRegAddr() const { return Kind == k_EsRegBorCRegAddr; }

  bool isEsRegRegAddr() const { return Kind == k_EsRegRegAddr; }
  bool isEsHlRegAddr() const { return Kind == k_EsHlRegAddr; }
  bool isHLAddr() const {
    return Kind == k_HLAddr && HLAddr.HlReg.RegNum == RL78::RP6;
  }
  bool is8BitReg() const { return (Kind == k_Register && Reg.Kind == rk_Reg); }
  bool is16BitReg() const {
    return (Kind == k_Register && Reg.Kind == rk_RegPair);
  }
  bool isSfr() const { return Kind == k_sfr; }
  bool isSfrp() const { return Kind == k_sfrp; }
  bool isEsAddr16() const { return Kind == k_EsAddr16; }

  StringRef getToken() const {
    assert(Kind == k_Token && "Invalid access!");
    return StringRef(Tok.Data, Tok.Length);
  }

  template <int N, int M> bool isImmInRange() const {
    const MCConstantExpr *MCE;

    if (isImm())
      MCE = dyn_cast<MCConstantExpr>(getImm());
    else if (isImm17())
      MCE = dyn_cast<MCConstantExpr>(getImm17());
    else if (isImm07())
      MCE = dyn_cast<MCConstantExpr>(getImm07());
    else if (isImm115())
      MCE = dyn_cast<MCConstantExpr>(getImm115());
    else
      return false;
    if (!MCE)
      return false;
    int64_t Val = MCE->getValue();
    return (Val >= N && Val <= M);
  }
  unsigned getStackSlotNoReg() const {
    assert((Kind == k_STACKSlot) && "Invalid access!");
    assert((STACKSlotNo.SPreg.RegNum == RL78::SPreg) && "Invalid Register!");
    return STACKSlotNo.SPreg.RegNum;
  }

  const MCExpr *getStackSlotNoImm() const {
    assert((Kind == k_STACKSlot) && "Invalid access!");
    return STACKSlotNo.Val;
  }

