ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  unsigned getRegBorCOffsetAddrReg() const {
    assert((Kind == k_RegBorCOffsetAddr) && "Invalid access!");
    return RegBorCOffsetAddr.Reg.RegNum;
  }

  const MCExpr *gettRegBorCOffsetAddrImm() const {
    assert((Kind == k_RegBorCOffsetAddr) && "Invalid access!");
    return RegBorCOffsetAddr.Val;
  }

  unsigned getRegOffsetAddrReg() const {
    assert((Kind == k_RegOffsetAddr) && "Invalid access!");
    return RegOffsetAddr.RPReg.RegNum;
  }

  unsigned getHLAddrReg() const {
    assert((Kind == k_HLAddr) && "Invalid access!");
    return HLAddr.HlReg.RegNum;
  }

  const MCExpr *gettRegOffsetAddrImm() const {
    assert((Kind == k_RegOffsetAddr) && "Invalid access!");
    return RegOffsetAddr.Val;
  }

  unsigned getRegRegAddrRpReg() const {
    assert((Kind == k_RegRegAddr) && "Invalid access!");
    return RegRegAddr.RPReg.RegNum;
  }
  unsigned getRegRegAddrRReg() const {
    assert((Kind == k_RegRegAddr) && "Invalid access!");
    return RegRegAddr.Reg.RegNum;
  }

  unsigned getEsRegRegRegEsReg() const {
    assert((Kind == k_EsRegRegReg) && "Invalid access!");
    return EsRegRegReg.ESReg.RegNum;
  }
  unsigned getEsRegRegRegRpReg() const {
    assert((Kind == k_EsRegRegReg) && "Invalid access!");
    return EsRegRegReg.RPReg.RegNum;
  }
  unsigned getEsRegRegRegRReg() const {
    assert((Kind == k_EsRegRegReg) && "Invalid access!");
    return EsRegRegReg.Reg.RegNum;
  }

  unsigned getEsRegRegAddrEsReg() const {
    assert((Kind == k_EsRegRegAddr) && "Invalid access!");
    return EsRegRegAddr.ESReg.RegNum;
  }
  unsigned getEsRegRegAddrRpReg() const {
    assert((Kind == k_EsRegRegAddr) && "Invalid access!");
    return EsRegRegAddr.RPReg.RegNum;
  }

  const MCExpr *gettEsRegRegAddrImm() const {
    assert((Kind == k_EsRegRegAddr) && "Invalid access!");
    return EsRegRegAddr.Val;
  }

  unsigned getEsRegBorCRegAddrEsReg() const {
    assert((Kind == k_EsRegBorCRegAddr) && "Invalid access!");
    return EsRegBorCRegAddr.ESReg.RegNum;
  }
  unsigned getEsRegBorCRegAddrReg() const {
    assert((Kind == k_EsRegBorCRegAddr) && "Invalid access!");
    return EsRegBorCRegAddr.Reg.RegNum;
  }

  const MCExpr *gettEsRegBorCRegAddrImm() const {
    assert((Kind == k_EsRegBorCRegAddr) && "Invalid access!");
    return EsRegBorCRegAddr.Val;
  }

  unsigned getEsHlRegAddrEsReg() const {
    assert((Kind == k_EsHlRegAddr) && "Invalid access!");
    return EsHlRegAddr.RL78RegES.RegNum;
  }
  unsigned getEsHlRegAddrHlReg() const {
    assert((Kind == k_EsHlRegAddr) && "Invalid access!");
    return EsHlRegAddr.RL78HL.RegNum;
  }

  unsigned getReg() const override {
    assert((Kind == k_Register) && "Invalid access!");
    return Reg.RegNum;
  }

  const MCExpr *getImm() const {
    assert((Kind == k_Immediate) && "Invalid access!");
    return Imm.Val;
  }
  const MCExpr *getAbs5() const {
    assert((Kind == k_Abs5) && "Invalid access!");
    return Abs5.Val;
  }
  const MCExpr *getCC() const {
    assert((Kind == k_cc) && "Invalid access!");
    return CC.Val;
  }
  const MCExpr *getImm07() const {
    assert((Kind == k_Imm07) && "Invalid access!");
    return Imm07.Val;
  }
  const MCExpr *getImm17() const {
    assert((Kind == k_Imm17) && "Invalid access!");
    return Imm17.Val;
  }
  const MCExpr *getImm115() const {
    assert((Kind == k_Imm115) && "Invalid access!");
    return Imm115.Val;
  }
  const MCExpr *getSELRBx() const {
    assert((Kind == k_selrbx) && "Invalid access!");
    return SELRBx.Val;
  }

  const MCExpr *getAbs16() const {
    assert((Kind == k_Abs16) && "Invalid access!");
    return Abs16.Val;
  }
  const MCExpr *getAbs8() const {
    assert((Kind == k_Abs8) && "Invalid access!");
    return Abs8.Val;
  }
  const MCExpr *getAbs20() const {
    assert((Kind == k_Abs20) && "Invalid access!");
    return Abs20.Val;
  }

  const MCExpr *getSfr() const {
    assert((Kind == k_sfr) && "Invalid access!");
    return sfr.Val;
  }

  const MCExpr *getSfrp() const {
    assert((Kind == k_sfrp) && "Invalid access!");
    return sfrp.Val;
  }

  unsigned getEsAddr16EsReg() const {
    assert((Kind == k_EsAddr16) && "Invalid access!");
    return EsAddr16.ESReg.RegNum;
  }
  const MCExpr *getEsAddr16Addr() const {
    assert((Kind == k_EsAddr16) && "Invalid access!");
    return EsAddr16.Val;
  }

  const MCExpr *getbrtargetAbs16() const {
    assert((Kind == k_brtargetAbs16) && "Invalid access!");
    return brtargetAbs16.Val;
  }

  const MCExpr *getbrtargetRel8() const {
    assert((Kind == k_brtargetRel8) && "Invalid access!");
    return brtargetRel8.Val;
  }

  const MCExpr *getbrtargetRel16() const {
    assert((Kind == k_brtargetRel16) && "Invalid access!");
    return brtargetRel16.Val;
  }

  unsigned getMemBase() const {
    assert((Kind == k_MemoryReg || Kind == k_MemoryImm) && "Invalid access!");
    return Mem.Base;
  }

  unsigned getMemOffsetReg() const {
    assert((Kind == k_MemoryReg) && "Invalid access!");
    return Mem.OffsetReg;
  }

  const MCExpr *getMemOff() const {
    assert((Kind == k_MemoryImm) && "Invalid access!");
    return Mem.Off;
  }

  /// getStartLoc - Get the location of the first token of this operand.
  SMLoc getStartLoc() const override { return StartLoc; }
  /// getEndLoc - Get the location of the last token of this operand.
  SMLoc getEndLoc() const override { return EndLoc; }

  void print(raw_ostream &OS) const override {
    switch (Kind) {
    case k_Token:
      OS << "Token: " << getToken() << "\n";
      break;
    case k_Register:
      OS << "Reg: #" << getReg() << "\n";
      break;
    case k_Immediate:
      OS << "Imm: " << getImm() << "\n";
      break;
    case k_MemoryReg:
      OS << "Mem: " << getMemBase() << "+" << getMemOffsetReg() << "\n";
      break;
    case k_MemoryImm:
      assert(getMemOff() != nullptr);
      OS << "Mem: " << getMemBase() << "+" << *getMemOff() << "\n";
      break;
    default:
      break;
    }
  }

  void addRegOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getReg()));
  }

