ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  void addImmOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getImm();
    addExpr(Inst, Expr);
  }

  void addCCOpOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getCC();
    addExpr(Inst, Expr);
  }

  void addImm07Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getImm07();
    addExpr(Inst, Expr);
  }

  void addImm17Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getImm17();
    addExpr(Inst, Expr);
  }

  void addImm115Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getImm115();
    addExpr(Inst, Expr);
  }

  void addSELRBxOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getSELRBx();
    addExpr(Inst, Expr);
  }

  void addABS8Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getAbs8();
    addExpr(Inst, Expr);
  }

  void addABS5Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getAbs5();
    addExpr(Inst, Expr);
  }

  void addABS16Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getAbs16();
    addExpr(Inst, Expr);
  }

  void addABS20Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getAbs20();
    addExpr(Inst, Expr);
  }

  void addSfrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getSfr();
    addExpr(Inst, Expr);
  }

  void addSfrpOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getSfrp();
    addExpr(Inst, Expr);
  }

  void addEsAddr16Operands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getEsAddr16EsReg()));
    const MCExpr *Expr = getEsAddr16Addr();
    addExpr(Inst, Expr);
  }

  void addbrtargetAbs16Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getbrtargetAbs16();
    addExpr(Inst, Expr);
  }

  void addbrtargetRel8Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getbrtargetRel8();
    addExpr(Inst, Expr);
  }

  void addbrtargetRel16Operands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    const MCExpr *Expr = getbrtargetRel16();
    addExpr(Inst, Expr);
  }

  void addSTACKSlotNoOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getStackSlotNoReg()));
    const MCExpr *Expr = getStackSlotNoImm();
    addExpr(Inst, Expr);
  }

  void addHLAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getHLAddrReg()));
  }

  void addRegBorCOffsetAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getRegBorCOffsetAddrReg()));
    const MCExpr *Expr = gettRegBorCOffsetAddrImm();
    addExpr(Inst, Expr);
  }
  void addRegOffsetAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getRegOffsetAddrReg()));
    const MCExpr *Expr = gettRegOffsetAddrImm();
    addExpr(Inst, Expr);
  }

  void addRegRegAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getRegRegAddrRpReg()));
    Inst.addOperand(MCOperand::createReg(getRegRegAddrRReg()));
  }

  void addEsRegRegRegOperands(MCInst &Inst, unsigned N) const {
    assert(N == 3 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getEsRegRegRegEsReg()));
    Inst.addOperand(MCOperand::createReg(getEsRegRegRegRpReg()));
    Inst.addOperand(MCOperand::createReg(getEsRegRegRegRReg()));
  }

  void addEsRegRegAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 3 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getEsRegRegAddrEsReg()));
    Inst.addOperand(MCOperand::createReg(getEsRegRegAddrRpReg()));
    const MCExpr *Expr = gettEsRegRegAddrImm();
    addExpr(Inst, Expr);
  }

  void addEsRegBorCRegAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 3 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getEsRegBorCRegAddrEsReg()));
    Inst.addOperand(MCOperand::createReg(getEsRegBorCRegAddrReg()));
    const MCExpr *Expr = gettEsRegBorCRegAddrImm();
    addExpr(Inst, Expr);
  }

  void addEsHlRegAddrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getEsHlRegAddrEsReg()));
    Inst.addOperand(MCOperand::createReg(getEsHlRegAddrHlReg()));
  }

  void addHLAddressOperands(MCInst &Inst, unsigned N) const {
    assert(N == 1 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getReg()));
  }

  void addExpr(MCInst &Inst, const MCExpr *Expr) const {
    // Add as immediate when possible.  Null MCExpr = 0.
    if (!Expr)
      Inst.addOperand(MCOperand::createImm(0));
    else if (const MCConstantExpr *CE = dyn_cast<MCConstantExpr>(Expr))
      Inst.addOperand(MCOperand::createImm(CE->getValue()));
    else
      Inst.addOperand(MCOperand::createExpr(Expr));
  }

  void addMemOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getMemBase()));
    const MCExpr *Expr = getMemOff();
    addExpr(Inst, Expr);
  }

  void addMEMrrOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getMemBase()));
    assert(getMemOffsetReg() != 0 && "Invalid offset");
    Inst.addOperand(MCOperand::createReg(getMemOffsetReg()));
  }

  void addMEMriOperands(MCInst &Inst, unsigned N) const {
    assert(N == 2 && "Invalid number of operands!");
    Inst.addOperand(MCOperand::createReg(getMemBase()));
    const MCExpr *Expr = getMemOff();
    addExpr(Inst, Expr);
  }

  static std::unique_ptr<RL78Operand> CreateToken(StringRef Str, SMLoc S) {
    auto Op = std::make_unique<RL78Operand>(k_Token);
    Op->Tok.Data = Str.data();
    Op->Tok.Length = Str.size();
    Op->StartLoc = S;
    Op->EndLoc = S;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateReg(unsigned RegNum, unsigned Kind,
                                                SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Register);
    Op->Reg.RegNum = RegNum;
    Op->Reg.Kind = (RL78Operand::RegisterKind)Kind;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateSTACKSlotNo(unsigned RegNum,
                                                        unsigned Kind,
                                                        const MCExpr *Val,
                                                        SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_STACKSlot);
    Op->STACKSlotNo.SPreg.RegNum = RegNum;
    Op->STACKSlotNo.SPreg.Kind = (RL78Operand::RegisterKind)Kind;
    Op->STACKSlotNo.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateRegOffsetAddr(unsigned RPRegNum,
                                                          unsigned RPRegKind,
                                                          const MCExpr *Val,
                                                          SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_RegOffsetAddr);
    Op->RegOffsetAddr.RPReg.RegNum = RPRegNum;
    Op->RegOffsetAddr.RPReg.Kind = (RL78Operand::RegisterKind)RPRegKind;
    Op->RegOffsetAddr.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand>
  CreateRegBorCOffsetAddr(unsigned RegNum, unsigned RegKind, const MCExpr *Val,
                          SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_RegBorCOffsetAddr);
    Op->RegBorCOffsetAddr.Reg.RegNum = RegNum;
    Op->RegBorCOffsetAddr.Reg.Kind = (RL78Operand::RegisterKind)RegKind;
    Op->RegBorCOffsetAddr.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand>
  CreateHLAddr(unsigned RPRegNum, unsigned RPRegKind, SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_HLAddr);
    Op->HLAddr.HlReg.RegNum = RPRegNum;
    Op->HLAddr.HlReg.Kind = (RL78Operand::RegisterKind)RPRegKind;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand>
  CreateRegRegAddr(unsigned RPRegNum, unsigned RPRegKind, unsigned RegNum,
                   unsigned RegKind, SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_RegRegAddr);
    Op->RegRegAddr.RPReg.RegNum = RPRegNum;
    Op->RegRegAddr.RPReg.Kind = (RL78Operand::RegisterKind)RPRegKind;
    Op->RegRegAddr.Reg.RegNum = RegNum;
    Op->RegRegAddr.Reg.Kind = (RL78Operand::RegisterKind)RegKind;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand>
  CreateEsRegRegAddr(unsigned ESRegNum, unsigned ESKind, unsigned RPRegNum,
                     unsigned RPKind, const MCExpr *Val, SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_EsRegRegAddr);
    Op->EsRegRegAddr.ESReg.RegNum = ESRegNum;
    Op->EsRegRegAddr.ESReg.Kind = (RL78Operand::RegisterKind)ESKind;
    Op->EsRegRegAddr.RPReg.RegNum = RPRegNum;
    Op->EsRegRegAddr.RPReg.Kind = (RL78Operand::RegisterKind)RPKind;
    Op->EsRegRegAddr.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
  static std::unique_ptr<RL78Operand>
  CreateEsRegBorCRegAddr(unsigned ESRegNum, unsigned ESKind, unsigned RegNum,
                         unsigned Kind, const MCExpr *Val, SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_EsRegBorCRegAddr);
    Op->EsRegBorCRegAddr.ESReg.RegNum = ESRegNum;
    Op->EsRegBorCRegAddr.ESReg.Kind = (RL78Operand::RegisterKind)ESKind;
    Op->EsRegBorCRegAddr.Reg.RegNum = RegNum;
    Op->EsRegBorCRegAddr.Reg.Kind = (RL78Operand::RegisterKind)Kind;
    Op->EsRegBorCRegAddr.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
  static std::unique_ptr<RL78Operand>
  CreateEsRegRegReg(unsigned ESRegNum, unsigned ESKind, unsigned RPRegNum,
                    unsigned RPKind, unsigned RegNum, unsigned Kind, SMLoc S,
                    SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_EsRegRegReg);
    Op->EsRegRegReg.ESReg.RegNum = ESRegNum;
    Op->EsRegRegReg.ESReg.Kind = (RL78Operand::RegisterKind)ESKind;
    Op->EsRegRegReg.RPReg.RegNum = RPRegNum;
    Op->EsRegRegReg.RPReg.Kind = (RL78Operand::RegisterKind)RPKind;
    Op->EsRegRegReg.Reg.RegNum = RegNum;
    Op->EsRegRegReg.Reg.Kind = (RL78Operand::RegisterKind)Kind;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand>
  CreateEsHlRegAddr(unsigned ESRegNum, unsigned ESKind, unsigned RPRegNum,
                    unsigned RPKind, SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_EsHlRegAddr);
    Op->EsHlRegAddr.RL78RegES.RegNum = ESRegNum;
    Op->EsHlRegAddr.RL78RegES.Kind = (RL78Operand::RegisterKind)ESKind;
    Op->EsHlRegAddr.RL78HL.RegNum = RPRegNum;
    Op->EsHlRegAddr.RL78HL.Kind = (RL78Operand::RegisterKind)RPKind;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateImm(const MCExpr *Val, SMLoc S,
                                                SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Immediate);
    Op->Imm.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

