ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  static std::unique_ptr<RL78Operand> CreateAbs5(const MCExpr *Val, SMLoc S,
                                                 SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Abs5);
    Op->Abs5.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateAbs8(const MCExpr *Val, SMLoc S,
                                                 SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Abs8);
    Op->Abs8.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateAbs16(const MCExpr *Val, SMLoc S,
                                                  SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Abs16);
    Op->Abs16.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateSfr(const MCExpr *Val, SMLoc S,
                                                SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_sfr);
    Op->sfr.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateSfrp(const MCExpr *Val, SMLoc S,
                                                 SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_sfrp);
    Op->sfrp.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateEsAddr16(unsigned RegNum,
                                                     unsigned RegKind,
                                                     const MCExpr *Val, SMLoc S,
                                                     SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_EsAddr16);
    Op->EsAddr16.ESReg.RegNum = RegNum;
    Op->EsAddr16.ESReg.Kind = (RL78Operand::RegisterKind)RegKind;
    Op->EsAddr16.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateAbs20(const MCExpr *Val, SMLoc S,
                                                  SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Abs20);
    Op->Abs20.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreatebrtargetRel8(const MCExpr *Val,
                                                         SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_brtargetRel8);
    Op->brtargetRel8.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreatebrtargetRel16(const MCExpr *Val,
                                                          SMLoc S, SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_brtargetRel16);
    Op->brtargetRel16.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateMEMr(unsigned Base, SMLoc S,
                                                 SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_MemoryReg);
    Op->Mem.Base = Base;
    Op->Mem.OffsetReg = RL78::R0; // always 0
    Op->Mem.Off = nullptr;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }

  static std::unique_ptr<RL78Operand> CreateSELRBx(const MCExpr *Val, SMLoc S,
                                                   SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_selrbx);
    Op->SELRBx.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
  static std::unique_ptr<RL78Operand> CreateImm07(const MCExpr *Val, SMLoc S,
                                                  SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Imm07);
    Op->Imm07.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
  static std::unique_ptr<RL78Operand> CreateImm17(const MCExpr *Val, SMLoc S,
                                                  SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Imm17);
    Op->Imm17.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
  static std::unique_ptr<RL78Operand> CreateImm115(const MCExpr *Val, SMLoc S,
                                                   SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_Imm115);
    Op->Imm115.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
  static std::unique_ptr<RL78Operand> CreateCC(const MCExpr *Val, SMLoc S,
                                               SMLoc E) {
    auto Op = std::make_unique<RL78Operand>(k_cc);
    Op->CC.Val = Val;
    Op->StartLoc = S;
    Op->EndLoc = E;
    return Op;
  }
};
} // end anonymous namespace

static std::map<std::string, int> ccTono{

    // C/NC/Z/NZ/H/NH.
    {"c", RL78CC::RL78CC_C},  {"nc", RL78CC::RL78CC_NC},
    {"z", RL78CC::RL78CC_Z},  {"nz", RL78CC::RL78CC_NZ},
    {"h", RL78CC::RL78CC_H},  {"nh", RL78CC::RL78CC_NH},
    {"f", RL78CC::RL78CC_NZ}, {"t", RL78CC::RL78CC_Z}};

RL78AsmParser::~RL78AsmParser() = default;

bool RL78AsmParser::MatchAndEmitInstruction(SMLoc IDLoc, unsigned &Opcode,
                                            OperandVector &Operands,
                                            MCStreamer &Out,
                                            uint64_t &ErrorInfo,
                                            bool MatchingInlineAsm) {

  MCInst Inst;
  SmallVector<MCInst, 8> Instructions;
  unsigned MatchResult =
      MatchInstructionImpl(Operands, Inst, ErrorInfo, MatchingInlineAsm);
  switch (MatchResult) {
  case Match_Success: {
    Inst.setLoc(IDLoc);
    Instructions.push_back(Inst);

    for (const MCInst &I : Instructions) {
      Out.emitInstruction(I, getSTI());
    }
    return false;
  }

  case Match_MissingFeature:
    return Error(IDLoc,
                 "instruction requires a CPU feature not currently enabled");

  case Match_InvalidOperand: {
    SMLoc ErrorLoc = IDLoc;
    if (ErrorInfo != ~0ULL) {
      if (ErrorInfo >= Operands.size())
        return Error(IDLoc, "too few operands for instruction");

      ErrorLoc = ((RL78Operand &)*Operands[ErrorInfo]).getStartLoc();
      if (ErrorLoc == SMLoc())
        ErrorLoc = IDLoc;
    }

    return Error(ErrorLoc, "invalid operand for instruction");
  }
  case Match_MnemonicFail:
    return Error(IDLoc, "invalid instruction mnemonic");
  }
  llvm_unreachable("Implement any new match types added!");
}

bool RL78AsmParser::tryParseBCCorSCC(OperandVector &Operands, StringRef Name,
                                     SMLoc NameLoc) {

