ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  // BC / BNC / BZ / BNZ / BH / BNH.
  // SC / SNC / SZ / SNZ / SH / SNH.
  // SK_cc.
  // BT/BF.
  StringRef mnemonic;
  StringRef operand;

  if (Name.substr(0, 1).compare("b") == 0 &&
      ccTono.find(std::string(Name.substr(1, Name.size()))) != ccTono.end()) {

    mnemonic = Name.substr(0, 1);
    operand = Name.substr(1, Name.size());

  } else if (Name.substr(0, 2).compare("sk") == 0 &&
             ccTono.find(std::string(Name.substr(2, Name.size()))) != ccTono.end()) {

    mnemonic = Name.substr(0, 2);
    operand = Name.substr(2, Name.size());

  } else
    return false;

  if (!mnemonic.empty() && !operand.empty()) {

    Operands.push_back(RL78Operand::CreateToken(mnemonic, NameLoc));
    SMLoc S = Parser.getTok().getLoc();
    SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
    const MCExpr *EVal;
    EVal = MCConstantExpr::create(ccTono[std::string(operand)], getContext());
    Operands.push_back(RL78Operand::CreateCC(EVal, S, E));
    return true;
  }

  return false;
}

/// parseIdentifier:
///   ::= identifier
///   ::= string
bool RL78AsmParser::parseIdentifier(StringRef &Res) {
  auto& Lexer = getLexer();
  // The assembler has relaxed rules for accepting identifiers, in particular we
  // allow things like '.globl $foo' and '.def @feat.00', which would normally be
  // separate tokens. At this level, we have already lexed so we cannot (currently)
  // handle this as a context dependent token, instead we detect adjacent tokens
  // and return the combined identifier.
  if (Lexer.is(AsmToken::Dollar) || Lexer.is(AsmToken::At)) {
    SMLoc PrefixLoc = Lexer.getLoc();

    // Consume the prefix character, and check for a following identifier.

    AsmToken Buf[1];
    Lexer.peekTokens(Buf, false);

    if (Buf[0].isNot(AsmToken::Identifier))
      return true;

    // We have a '$' or '@' followed by an identifier, make sure they are adjacent.
    if (PrefixLoc.getPointer() + 1 != Buf[0].getLoc().getPointer())
      return true;

    // eat $ or @
    Lexer.Lex(); // Lexer's Lex guarantees consecutive token.
    // Construct the joined identifier and consume the token.
    Res =
        StringRef(PrefixLoc.getPointer(), getTok().getIdentifier().size() + 1);
    Lex(); // Parser Lex to maintain invariants.
    return false;
  }

  if (getLexer().isNot(AsmToken::Identifier) && getLexer().isNot(AsmToken::String))
    return true;

  Res = getTok().getIdentifier();

  Lex(); // Consume the identifier token.

  return false;
}

/// parseDirectiveSymbolAttribute
///  ::= { ".globl", ".weak", ... } [ identifier ( , identifier )* ]
bool RL78AsmParser::parseDirectiveSymbolAttribute(MCSymbolAttr Attr) {
  auto parseOp = [&]() -> bool {
    StringRef Name;
    SMLoc Loc = getTok().getLoc();
    if (parseIdentifier(Name))
      return Error(Loc, "expected identifier");
    MCSymbol *Sym = getContext().getOrCreateSymbol(Name);

    // Assembler local symbols don't make any sense here. Complain loudly.
    if (Sym->isTemporary())
      return Error(Loc, "non-local symbol required");

    if (!getStreamer().emitSymbolAttribute(Sym, Attr))
      return Error(Loc, "unable to emit symbol attribute");
    return false;
  };

  if (parseMany(parseOp))
    return addErrorSuffix(" in directive");
  return false;
}

void RL78AsmParser::eatToEndOfStatement() {
  auto& Lexer = getLexer();
  while (Lexer.isNot(AsmToken::EndOfStatement) && Lexer.isNot(AsmToken::Eof))
    Lexer.Lex();

  // Eat EOL.
  if (Lexer.is(AsmToken::EndOfStatement))
    Lexer.Lex();
}

bool RL78AsmParser::eatSpacesTillEndOfLine() {
  auto &Lexer = getLexer();
  while (Lexer.is(AsmToken::Space) || Lexer.is(AsmToken::Comment)) {
    Lexer.Lex();
  }
  if (Lexer.isNot(AsmToken::EndOfStatement))
    return true;
  return false;
}

bool RL78AsmParser::ParseSectionName(StringRef &SectionName) {
  // A section name can contain -, so we cannot just use
  // parseIdentifier.
  SMLoc FirstLoc = getLexer().getLoc();
  unsigned Size = 0;

  if (getLexer().is(AsmToken::String)) {
    SectionName = getTok().getIdentifier();
    Lex();
    return false;
  }

  while (!getParser().hasPendingError()) {
    SMLoc PrevLoc = getLexer().getLoc();
    if (getLexer().is(AsmToken::Comma) ||
      getLexer().is(AsmToken::EndOfStatement))
      break;

    unsigned CurSize;
    if (getLexer().is(AsmToken::String)) {
      CurSize = getTok().getIdentifier().size() + 2;
      Lex();
    } else if (getLexer().is(AsmToken::Identifier)) {
      CurSize = getTok().getIdentifier().size();
      Lex();
    } else {
      CurSize = getTok().getString().size();
      Lex();
    }
    Size += CurSize;
    SectionName = StringRef(FirstLoc.getPointer(), Size);

    // Make sure the following token is adjacent.
    if (PrevLoc.getPointer() + CurSize != getTok().getLoc().getPointer())
      break;
  }
  if (Size == 0)
    return true;

  return false;
}

void RL78AsmParser::InitializeRelocationAttributeMap() {
  // clang-format off
  RelocationAttributeMap["CALLT0"] =         {".callt0", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 2, true, ".CSEG"};
  RelocationAttributeMap["TEXT"] =           {".text", ELF::SHT_PROGBITS, ELF::SHF_ALLOC | ELF::SHF_EXECINSTR, 1, true, ".CSEG"};
  RelocationAttributeMap["TEXTF"] =          {".textf", ELF::SHT_PROGBITS, ELF::SHF_ALLOC | ELF::SHF_EXECINSTR, 1, true, ".CSEG"};
  RelocationAttributeMap["TEXTF_UNIT64KP"] = {".textf_unit64kp", ELF::SHT_PROGBITS, ELF::SHF_ALLOC | ELF::SHF_EXECINSTR, 2, true, ".CSEG"};
  RelocationAttributeMap["CONST"] =          {".const", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 2, true, ".CSEG"};
  RelocationAttributeMap["CONSTF"] =         {".constf", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 2, true, ".CSEG"};
  RelocationAttributeMap["SDATA"] =          {".sdata", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 2, true, ".DSEG"};
  RelocationAttributeMap["SBSS"] =           {".sbss", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE, 2, true, ".DSEG"};
  RelocationAttributeMap["SBSS_BIT"] =       {".sbss_bit", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE, 2, true, ".BSEG"};
  RelocationAttributeMap["DATA"] =           {".data", ELF::SHT_PROGBITS, ELF::SHF_ALLOC,2, true, ".DSEG"};
  RelocationAttributeMap["BSS"] =            {".bss", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE, 2, true, ".DSEG"};
  RelocationAttributeMap["BSS_BIT"] =        {".bss_bit", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE, 2, true, ".BSEG"};
  RelocationAttributeMap["DATAF"] =          {".dataf", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 2, true, ".DSEG"};
  RelocationAttributeMap["BSSF"] =           {".bssf", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE, 2, true, ".DSEG"};
  RelocationAttributeMap["AT"] =             {".text_AT", ELF::SHT_PROGBITS, ELF::SHF_ALLOC | ELF::SHF_EXECINSTR | ELF::SHF_RENESAS_ABS, 1, false, ".CSEG"};
  RelocationAttributeMap["DATA_AT"] =        {".data_AT", ELF::SHT_PROGBITS, ELF::SHF_ALLOC | ELF::SHF_RENESAS_ABS, 1, false, ".DSEG"};
  RelocationAttributeMap["BSS_AT"] =         {".bss_AT", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE | ELF::SHF_RENESAS_ABS, 1, false, ".DSEG"};
  RelocationAttributeMap["BIT_AT"] =         {"", ELF::SHT_NOBITS, ELF::SHF_ALLOC | ELF::SHF_WRITE | ELF::SHF_RENESAS_ABS, 1, false, ".BSEG"};
  RelocationAttributeMap["OPT_BYTE"] =       {".option_byte", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 1, false, ".CSEG"};// TODO error check for rename
  RelocationAttributeMap["SECUR_ID"] =       {".security_id", ELF::SHT_PROGBITS, ELF::SHF_ALLOC, 1, false, ".CSEG"};// TODO error check for rename
  // clang-format on
}

bool RL78AsmParser::ParseSectionAddress(std::string SectionName,
                                        std::string &NewSectionName) {
  const MCExpr *Value;
  uint64_t SectionAddress;
  SMLoc ExprLoc = getLexer().getLoc();
  if (getParser().parseExpression(Value))
    return true;
  if (const MCConstantExpr *MCE = dyn_cast<MCConstantExpr>(Value)) {
    SectionAddress = MCE->getValue();
    if (!isUIntN(20, SectionAddress))
      return Error(ExprLoc, "out of range literal value");
  } else
    return Error(ExprLoc, "out of range literal value");

  std::ostringstream ss;
  ss << "_AT" << std::uppercase << std::hex << SectionAddress;
  NewSectionName = SectionName + ss.str();
  return false;
}

void RL78AsmParser::SwitchToSection(StringRef NewSectionName, unsigned Type,
                                    unsigned Flags) {
  int64_t Size = 0;
  StringRef GroupName;
  const MCExpr *Subsection = nullptr;
  MCSymbolELF *Associated = nullptr;
  int64_t UniqueID = ~0;
  MCSection *ELFSection = getParser().getContext().getELFSection(
      NewSectionName, Type, Flags, Size, GroupName, false, (unsigned)UniqueID, (const MCSymbolELF *)Associated);

  getStreamer().switchSection(ELFSection, Subsection);
}

