ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
bool RL78AsmParser::EmitSectionDirective(
    StringRef SectionName, StringRef RelocationAttribute,
    const RelocationAttributeDefault* RelocationAttributeDesc) {
  // Parse and handle absolute section address.
  std::string NewSectionName = SectionName.str();
  if (RelocationAttribute.compare("AT") == 0 ||
      RelocationAttribute.compare("DATA_AT") == 0 ||
      RelocationAttribute.compare("BSS_AT") == 0 ||
      RelocationAttribute.compare("BIT_AT") == 0) {

    // TODO check for overlaps at compile time already?
    if (ParseSectionAddress(std::string(SectionName), NewSectionName))
      return true;
  }

  // We expect spaces, comments, EOF/EOL only after this on this line.
  if (eatSpacesTillEndOfLine())
    return TokError("unexpected token in directive");

  unsigned Flags = RelocationAttributeDesc->Flags;
  // If .ORG is written immediately after a section definition directive, the
  // section is only generated from the absolute address.
  AsmToken NextToken = getLexer().peekTok();
  if (NextToken.is(AsmToken::Identifier) &&
      (NextToken.getString().compare(".ORG") == 0)) {
    // Eat EndOfStatement.
    Lex();
    // Eat .ORG.
    Lex();
    if (ParseSectionAddress(std::string(SectionName), NewSectionName))
      return true;
    Flags = Flags | ELF::SHF_RENESAS_ABS;
  }

  SwitchToSection(NewSectionName, RelocationAttributeDesc->Type, Flags);

  // Apply the default section align
  if (RelocationAttribute.compare("TEXT") == 0 ||
      RelocationAttribute.compare("TEXT") == 0 ||
      RelocationAttribute.compare("TEXTF") == 0 ||
      RelocationAttribute.compare("TEXTF_UNIT64KP") == 0) {
    getStreamer().emitCodeAlignment(
        RelocationAttributeDesc->DefaultAlign, &getSTI(), 0);
  } else {
    getStreamer().emitValueToAlignment(
        RelocationAttributeDesc->DefaultAlign, 0, 1);
  }

  return false;
}

bool RL78AsmParser::LookupRelocationAttribute(
    StringRef SectionName, StringRef Attribute,
    RelocationAttributeDefault **RelocationAttributeDesc) {
  auto RelocationAttributeMatch = RelocationAttributeMap.find(Attribute);

  if (RelocationAttributeMatch == RelocationAttributeMap.end())
    return TokError("unexpected relocation-attribute in directive");

  if (Attribute.compare("OPT_BYTE") == 0 && SectionName.compare("") != 0 && SectionName.compare(".option_byte") != 0 ||
      Attribute.compare("SECUR_ID") == 0 && SectionName.compare("") != 0 && SectionName.compare(".security_id") != 0)
	return TokError("special section name cannot be changed");

  // Not exactly an appropriate place, but check for section name correctness
  // too.
  if (SectionName.compare("") != 0 &&
      !std::regex_match(std::string(SectionName.str()), std::regex("[A-Za-z0-9\._@]+")))
    return TokError("invalid characters in section name");

  *RelocationAttributeDesc = &RelocationAttributeMatch->second;
  return false;
}

bool RL78AsmParser::ParseSectionArguments(SMLoc loc) {
  StringRef SectionName;

  if (ParseSectionName(SectionName))
    return TokError("expected identifier in directive");

  if (getLexer().is(AsmToken::Comma)) {
    Lex();
    if (getLexer().isNot(AsmToken::Identifier)) {
      return TokError("expected relocation-attribute in directive");
    } else {
      StringRef RelocationAttribute = getTok().getIdentifier();
      Lex();
      RelocationAttributeDefault *RelocationAttributeDesc;
      if (LookupRelocationAttribute(SectionName, RelocationAttribute, &RelocationAttributeDesc))
        return true;

      return EmitSectionDirective(SectionName, RelocationAttribute,
                                  RelocationAttributeDesc);
    }
  } else {
    return TokError("unexpected relocation-attribute in directive");
  }
}

bool RL78AsmParser::parseDirectiveSeg(StringRef Name, StringRef Type) {

  StringRef RelocationAttribute;
  if (Type.compare(".CSEG") == 0)
    RelocationAttribute = "TEXT";
  else if (Type.compare(".DSEG") == 0)
    RelocationAttribute = "DATA";
  else if (Type.compare(".BSEG") == 0)
    RelocationAttribute = "SBSS_BIT";
  else
    return TokError("unexpected directive kind");

  // See if a relocation attribute is present
  if (getLexer().is(AsmToken::Identifier)) {
    RelocationAttribute = getLexer().getTok().getIdentifier();
    Lex();
  }
  RelocationAttributeDefault *RelocationAttributeDesc;
  if (LookupRelocationAttribute(Name, RelocationAttribute, &RelocationAttributeDesc))
    return true;
  return EmitSectionDirective(Name.compare("") == 0
                                  ? RelocationAttributeDesc->DefaultSectionName
                                  : Name,
                              RelocationAttribute, RelocationAttributeDesc);
}

bool RL78AsmParser::ParseDirectiveOrg() {
  std::string NewSectionName;
  MCSectionELF *CurrentSection =
      dyn_cast<MCSectionELF>(getStreamer().getCurrentSectionOnly());
  // std::string SectionNamePrefix = CurrentSection->getSectionName();
  std::string SectionNamePrefix = "";

  // If the section name already has the _AT<address> suffix, drop it
  SectionNamePrefix =
      std::regex_replace(SectionNamePrefix, std::regex("_AT[0-9a-fA-F]*$"), "");

  if (ParseSectionAddress(SectionNamePrefix, NewSectionName))
    return true;

  SwitchToSection(NewSectionName, CurrentSection->getType(),
                  CurrentSection->getFlags() | ELF::SHF_RENESAS_ABS);

  return false;
}

bool RL78AsmParser::ParseDirectiveOffset() {
  const MCExpr *Offset;
  SMLoc OffsetLoc = getLexer().getLoc();
  if (checkForValidSection() || getParser().parseExpression(Offset))
    return true;
  int64_t FillExpr = 0;
  if (parseToken(AsmToken::EndOfStatement))
    return addErrorSuffix(" in '.OFFSET' directive");

  getStreamer().emitValueToOffset(Offset, FillExpr, OffsetLoc);
  return false;
}

bool RL78AsmParser::checkForValidSection() {
  if (!ParsingMSInlineAsm && !getStreamer().getCurrentSectionOnly()) {
    getStreamer().initSections(false, getSTI());
    return Error(getTok().getLoc(),
                 "expected section directive before assembly directive");
  }
  return false;
}

bool RL78AsmParser::parseDirectiveValue(StringRef IDVal, unsigned Size) {
  auto parseOp = [&]() -> bool {
    const MCExpr *Value;
    SMLoc ExprLoc = getLexer().getLoc();

    if (getLexer().getTok().is(AsmToken::String)) {
      if (Size != 1)
        return Error(ExprLoc, "Illegal string.");
      getStreamer().emitBytes(getLexer().getTok().getStringContents());
      Lex();
      return false;
    }

    if (checkForValidSection() || getParser().parseExpression(Value))
      return true;

    if (const MCConstantExpr *MCE = dyn_cast<MCConstantExpr>(Value)) {
      assert(Size <= 8 && "Invalid size");
      uint64_t IntValue = MCE->getValue();
      if (!isUIntN(8 * Size, IntValue) && !isIntN(8 * Size, IntValue))
        return Error(ExprLoc, "out of range literal value");
      getStreamer().emitIntValue(IntValue, Size);
    } else {
      getStreamer().emitValue(Value, Size, ExprLoc);
    }
    return false;
  };

  if (parseMany(parseOp))
    return addErrorSuffix(" in '" + Twine(IDVal) + "' directive");
  return false;
}

bool RL78AsmParser::parseDSDirective() {
  const MCExpr *Value;
  SMLoc ExprLoc = getLexer().getLoc();
  if (checkForValidSection() || getParser().parseExpression(Value))
    return true;
  // Special case constant expressions to match code generator.
  if (const MCConstantExpr *MCE = dyn_cast<MCConstantExpr>(Value)) {
    uint64_t AllocationSize = MCE->getValue();
    if (AllocationSize > 0xFFFFF)
      return Error(ExprLoc, "out of range literal value");
    for (uint32_t i = 1; i <= AllocationSize / 8; i++)
      getStreamer().emitIntValue(0, 8);
    getStreamer().emitIntValue(0, AllocationSize % 8);
  } else
    return Error(ExprLoc, "invalid absolute-expression");
  return false;
}

