ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
bool RL78AsmParser::parseDirectiveAlign() {
  SMLoc AlignmentLoc = getLexer().getLoc();
  int64_t Alignment;
  SMLoc MaxBytesLoc;
  bool HasFillExpr = false;
  int64_t FillExpr = 0;
  int64_t MaxBytesToFill = 0;

  if (checkForValidSection())
    return addErrorSuffix(" in directive");

  const MCExpr *Value;
  SMLoc ExprLoc = getLexer().getLoc();
  if (checkForValidSection() || getParser().parseExpression(Value))
    return true;

  if (const MCConstantExpr *MCE = dyn_cast<MCConstantExpr>(Value)) {
    uint64_t IntValue = MCE->getValue();
    // TODO: since the standard specifies powers of two, we do the same.
    // Revisit if we really need to allow any even alignment.
    if (IntValue < 2 || !llvm::isPowerOf2_64(IntValue))
      return Error(ExprLoc, "out of range literal value");
    Alignment = IntValue;
  } else {
    return Error(ExprLoc, "expected constant expression");
  }
  // Always emit an alignment here even if we thrown an error.
  bool ReturnVal = false;

  // Diagnose non-sensical max bytes to align.
  if (MaxBytesLoc.isValid()) {
    if (MaxBytesToFill < 1) {
      ReturnVal |= Error(MaxBytesLoc,
                         "alignment directive can never be satisfied in this "
                         "many bytes, ignoring maximum bytes expression");
      MaxBytesToFill = 0;
    }

    if (MaxBytesToFill >= Alignment) {
      Warning(MaxBytesLoc, "maximum bytes expression exceeds alignment and "
                           "has no effect");
      MaxBytesToFill = 0;
    }
  }

  // Check whether we should use optimal code alignment for this .align
  // directive.
  const MCSection *Section = getStreamer().getCurrentSectionOnly();
  assert(Section && "must have section to emit alignment");
  bool UseCodeAlign = Section->useCodeAlign();
  if (!HasFillExpr && UseCodeAlign) {
    getStreamer().emitCodeAlignment(Alignment, &getSTI(), MaxBytesToFill);
  } else {
    // FIXME: Target specific behavior about how the "extra" bytes are filled.
    getStreamer().emitValueToAlignment(Alignment, FillExpr, 1, MaxBytesToFill);
  }
  return ReturnVal;
}

std::string RL78AsmParser::ReplaceMacroLocalSymbols(
    std::string MacroBody, StringMap<std::string> &MacroLocalSymbols,
    SmallVector<MacroLocalDefinitionRange, 10> &MacroLocalSymbolRanges) {

  // Delete .LOCAL definitions from the macro body
  size_t Offset = 0;
  for (const MacroLocalDefinitionRange &Range : MacroLocalSymbolRanges) {
    size_t Length = Range.End - Range.Start;
    MacroBody.erase(Range.Start - Offset, Length);
    Offset += Length;
  }

  // Replace .LOCAL symbols from the macro definition
  // with unique local file level symbols
  for (const StringMapEntry<std::string> &LocalSymbol : MacroLocalSymbols)
    MacroBody =
        std::regex_replace(MacroBody, std::regex(LocalSymbol.getKey().str()),
                           LocalSymbol.getValue());

  return MacroBody;
}

bool RL78AsmParser::parseMacroLocalSymbols(
    StringMap<std::string> &MacroLocalSymbols) {
  auto parseOp = [&]() -> bool {
    StringRef Name;
    SMLoc Loc = getTok().getLoc();
    if (parseIdentifier(Name))
      return Error(Loc, "expected identifier");
    std::string LocalSymbolName = ".LL_" + Name.str() + "_\\@";
    MacroLocalSymbols[Name] = LocalSymbolName;
    /*MCSymbol *Sym = getContext().getOrCreateSymbol(LocalSymbolName);

    if (!getStreamer().EmitSymbolAttribute(Sym, MCSA_Local))
      return Error(Loc, "unable to emit symbol attribute");*/
    return false;
  };

  if (parseMany(parseOp))
    return addErrorSuffix(" in directive");
  return false;
}

bool RL78AsmParser::parseDirectiveMacro(StringRef Name) {

  SMLoc DirectiveLoc = getLexer().getLoc();

  // Eat the .MACRO
  Lex();

  MCAsmMacroParameters Parameters;
  while (getLexer().isNot(AsmToken::EndOfStatement)) {

    MCAsmMacroParameter Parameter;
    if (parseIdentifier(Parameter.Name))
      return TokError("expected identifier in '.macro' directive");

    // Emit an error if two (or more) named parameters share the same name
    for (const MCAsmMacroParameter &CurrParam : Parameters)
      if (CurrParam.Name.equals(Parameter.Name))
        return TokError("macro '" + Name +
                        "' has multiple parameters"
                        " named '" +
                        Parameter.Name + "'");
    // CC-RL has only required parameters
    Parameter.Required = true;
    Parameters.push_back(std::move(Parameter));

    if (getLexer().is(AsmToken::Comma))
      Lex();
  }

  // Eat just the end of statement.
  getLexer().Lex();

  // Consuming deferred text, so use Lexer.Lex to ignore Lexing Errors
  AsmToken EndToken, StartToken = getTok();
  StringMap<std::string> MacroLocalSymbolMap;
  SmallVector<MacroLocalDefinitionRange, 10> MacroLocalSymbolRanges;
  // Lex the macro definition.
  while (true) {
    // Ignore Lexing errors in macros.
    while (getLexer().is(AsmToken::Error)) {
      getLexer().Lex();
    }

    // Check whether we have reached the end of the file.
    if (getLexer().is(AsmToken::Eof))
      return Error(DirectiveLoc, "no matching '.ENDM' in definition");

    if (getLexer().is(AsmToken::Identifier)) {
      if (getTok().getIdentifier() == ".LOCAL") {
        // Parse macro local symbol declarations and save
        // the declaration start/end position.
        size_t Start =
            getTok().getLoc().getPointer() - StartToken.getLoc().getPointer();
        getLexer().Lex();
        parseMacroLocalSymbols(MacroLocalSymbolMap);
        size_t End =
            getTok().getLoc().getPointer() - StartToken.getLoc().getPointer();
        MacroLocalSymbolRanges.push_back({Start, End});
      } else if (getTok().getIdentifier() == ".ENDM") {
        EndToken = getTok();
        getLexer().Lex();
        if (getLexer().isNot(AsmToken::EndOfStatement))
          return TokError("unexpected token in '" + EndToken.getIdentifier() +
                          "' directive");
        break;
      }
    }

    // Otherwise, scan til the end of the statement.
    eatToEndOfStatement();
  }

  if (getContext().lookupMacro(Name)) {
    return Error(DirectiveLoc, "macro '" + Name + "' is already defined");
  }

  const char *BodyStart = StartToken.getLoc().getPointer();
  const char *BodyEnd = EndToken.getLoc().getPointer();
  std::string Body = StringRef(BodyStart, BodyEnd - BodyStart).str();

  // Prepend "\" to parameters, as expected by the gcc syntax
  // The other option would be to reimplement handleMacroEntry and all the
  // related functions.
  for (const MCAsmMacroParameter &CurrParam : Parameters)
    Body = std::regex_replace(Body, std::regex(CurrParam.Name.str()),
                              ("\\" + CurrParam.Name).str());

  // Save new body
  MacroBodies[Name] = ReplaceMacroLocalSymbols(Body, MacroLocalSymbolMap,
                                               MacroLocalSymbolRanges);

