ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  // checkForBadMacro(DirectiveLoc, Name, Body, Parameters);
  MCAsmMacro Macro(Name, StringRef(MacroBodies[Name]), std::move(Parameters));
  DEBUG_WITH_TYPE("asm-macros", dbgs() << "Defining new macro:\n";
                  Macro.dump());
  getContext().defineMacro(Name, std::move(Macro));
  return false;
}


/// Returns whether the given symbol is used anywhere in the given expression,
/// or subexpressions.
static bool isSymbolUsedInExpression(const MCSymbol *Sym, const MCExpr *Value) {
  switch (Value->getKind()) {
  case MCExpr::Binary: {
    const MCBinaryExpr *BE = static_cast<const MCBinaryExpr *>(Value);
    return isSymbolUsedInExpression(Sym, BE->getLHS()) ||
           isSymbolUsedInExpression(Sym, BE->getRHS());
  }
  case MCExpr::Target:
  case MCExpr::Constant:
    return false;
  case MCExpr::SymbolRef: {
    const MCSymbol &S =
        static_cast<const MCSymbolRefExpr *>(Value)->getSymbol();
    if (S.isVariable())
      return isSymbolUsedInExpression(Sym, S.getVariableValue());
    return &S == Sym;
  }
  case MCExpr::Unary:
    return isSymbolUsedInExpression(
        Sym, static_cast<const MCUnaryExpr *>(Value)->getSubExpr());
  }

  llvm_unreachable("Unknown expr kind!");
}

static bool checkSymbolDefinitionExpression(StringRef Name, bool allow_redef,
                               MCAsmParser &Parser, MCSymbol *&Sym,
                               const MCExpr *Value, SMLoc EqualLoc) {

  if (Parser.parseToken(AsmToken::EndOfStatement))
    return true;

  // Validate that the LHS is allowed to be a variable (either it has not been
  // used as a symbol, or it is an absolute symbol).
  Sym = Parser.getContext().lookupSymbol(Name);
  if (Sym) {
    // Diagnose assignment to a label.
    //
    // FIXME: Diagnostics. Note the location of the definition as a label.
    // FIXME: Diagnose assignment to protected identifier (e.g., register name).
    if (Value && isSymbolUsedInExpression(Sym, Value))
      return Parser.Error(EqualLoc, "Recursive use of '" + Name + "'");
    else if (Sym->isUndefined(/*SetUsed*/ false) && !Sym->isUsed() &&
             !Sym->isVariable())
      ; // Allow redefinitions of undefined symbols only used in directives.
    else if (Sym->isVariable() && !Sym->isUsed() && allow_redef)
      ; // Allow redefinitions of variables that haven't yet been used.
    else if (!Sym->isUndefined() && (!Sym->isVariable() || !allow_redef))
      return Parser.Error(EqualLoc, "redefinition of '" + Name + "'");
    else if (!Sym->isVariable())
      return Parser.Error(EqualLoc, "invalid assignment to '" + Name + "'");
    else if (!isa<MCConstantExpr>(Sym->getVariableValue()))
      return Parser.Error(EqualLoc,
                          "invalid reassignment of non-absolute variable '" +
                              Name + "'");
  }   
  return false;
}

bool RL78AsmParser::HasTargetSubExpressionKind(const MCExpr *Expr,
                                               unsigned TargetExpressionKind) {

  switch (Expr->getKind()) {
  case MCExpr::Binary: {
    const MCBinaryExpr *BExpr = cast<MCBinaryExpr>(Expr);
    return HasTargetSubExpressionKind(BExpr->getLHS(), TargetExpressionKind) ||
           HasTargetSubExpressionKind(BExpr->getRHS(), TargetExpressionKind);
  }
  case MCExpr::Constant:
  case MCExpr::SymbolRef:
    return false;
  case MCExpr::Unary:
    return HasTargetSubExpressionKind(cast<MCUnaryExpr>(Expr)->getSubExpr(),
                                      TargetExpressionKind);

  case MCExpr::Target: {
    const RL78MCExpr *TExpr = cast<RL78MCExpr>(Expr);
    return TExpr->getVariantKind() == TargetExpressionKind;
  }
  default:
    return false;
  }
}

bool RL78AsmParser::parseDirectiveSet(StringRef Name) {
  // Each name is a redefinable name.
  // A bit position specification cannot be defined.
  // The name generated by the .SET directive cannot be externally defined by
  // the .PUBLIC directive.
  MCSymbol *Sym = nullptr;
  const MCExpr *Value = nullptr;
  SMLoc EqualLoc = Parser.getTok().getLoc();
  // Eat the .SET
  Lex();

  if (Parser.parseExpression(Value))
    return Parser.TokError("missing expression");

  if (HasTargetSubExpressionKind(Value, RL78MCExpr::VK_RL78_BITPOSITIONAL))
    return Error(EqualLoc, "invalid expression");

  int64_t Res;
  if (!Value->evaluateAsAbsolute(Res))
    return Parser.TokError("not an absolute expression");

  if (checkSymbolDefinitionExpression(Name, true, getParser(), Sym, Value,
                                      EqualLoc))
    return true;
  if (!Sym)
    Sym = Parser.getContext().getOrCreateSymbol(Name);
  else if (Sym->isExternal())
    return Error(EqualLoc, "symbol already defined as public/extern");

  Sym->setRedefinable(true);
  getStreamer().emitAssignment(Sym, MCConstantExpr::create(Res, getContext()));
  return false;
}

bool RL78AsmParser::SplitBitPosition(std::string *AddressSymbol,
                                     int64_t *AddressValue,
                                     int64_t *BitPosition, bool *IsSymAddress,
                                     std::string *ErrorMsg) {
  // TODO: check in case of symbols that they are not in turn bit positionals

  auto Parts = Parser.getTok().getString().split('.');
  // For absolute values, address and bit position, the AsmLexer already
  // validated the ranges Handle the address part
  if (Parts.first.startswith("0x")) {
    *IsSymAddress = false;
    std::stringstream ss;
    ss << std::hex << Parts.first.str();
    ss >> *AddressValue;
  } else {
    *IsSymAddress = true;
    *AddressSymbol = std::string(Parts.first);
  }

  // Handle the bit part
  if (Parts.second[0] >= '0' && Parts.second[0] <= '7') {
    *BitPosition = Parts.second[0] - '0';
  } else {
    // Bit symbol should be a locally resolved symbol.
    const MCSymbol *BitSym = Parser.getContext().lookupSymbol(Parts.second);
    if (!BitSym) {
      *ErrorMsg = "unresolved bit position symbol";
      return true;
    }

    int64_t Position = -1;
    if (BitSym->isVariable() &&
        BitSym->getVariableValue()->evaluateAsAbsolute(Position)) {
      if (Position >= 0 && Position <= 7) {
        *BitPosition = Position;
      } else {
        *ErrorMsg = "bit position not in [0, 7] range";
        return true;
      }
    } else {
      *ErrorMsg = "invalid bit position symbol";
      return true;
    }
  }
  return false;
}

bool RL78AsmParser::parseDirectiveEqu(StringRef Name) {
  // Symbols that have already been defined by using .EQU cannot be redefined.
  // The name generated by the .EQU directive can be externally defined by the
  // .PUBLIC directive. A bit position specification can be defined.
  // Relocatable terms cannot be specified in the operand field.
  MCSymbol *Sym;
  MCSymbol *BitPosSym =
      Parser.getContext().lookupSymbol(BitPositionSymbolPrefix + Name);

  SMLoc EqualLoc = Parser.getTok().getLoc();
  // Eat the .EQU
  Lex();

  int64_t AbsoluteValue = 0;
  bool CreateBitposSym = false;
  int64_t BitPosition = -1;
  // .EQU will treat dots as bit positional specifiers.
  const MCExpr *Value = nullptr;

  if (Parser.parseExpression(Value))
    return Parser.TokError("missing expression");

  // Parse expression already tried to constant fold it
  if (Value->getKind() == MCExpr::Constant) {
    AbsoluteValue = cast<MCConstantExpr>(Value)->getValue();
  } else {
    // The expression contains a target expression somewhere or it's couldn't
    // constant fold it.
    MCValue AbsVal;
    if (!HasTargetSubExpressionKind(Value, RL78MCExpr::VK_RL78_BITPOSITIONAL) ||
        !RL78MCExpr::FoldBitPositionalExpression(Value, AbsVal, BitPosition,
                                                 getContext()) ||
        !AbsVal.isAbsolute() || BitPosition == -1)
      return Error(EqualLoc, "invalid expression");
    AbsoluteValue = AbsVal.getConstant();
    CreateBitposSym = true;
  }

  if (checkSymbolDefinitionExpression(Name, false, getParser(), Sym, Value,
                                      EqualLoc))
    return true;

  if (CreateBitposSym && BitPosSym)
    return Parser.TokError("bit position symbol already defined");

  // At this point we should have an absolute value and possibly a bit position
  // value. Create the symbol(s) and assign values.
  bool ShouldBePublic = false;
  if (!Sym)
    Sym = Parser.getContext().getOrCreateSymbol(Name);
  else
    ShouldBePublic = Sym->isExternal();
  Sym->setRedefinable(false);

  if (CreateBitposSym) {
    BitPosSym =
        Parser.getContext().getOrCreateSymbol(BitPositionSymbolPrefix + Name);
    BitPosSym->setRedefinable(false);
    MCSymbolELF *ELFBitPosSymbol = cast<MCSymbolELF>(BitPosSym);
    ELFBitPosSymbol->setType(ELF::STT_HIPROC);

    if (ShouldBePublic &&
        !getStreamer().emitSymbolAttribute(BitPosSym, MCSA_Global))
      return Error(Parser.getTok().getLoc(), "unable to emit symbol attribute");

    getStreamer().emitAssignment(
        BitPosSym, MCConstantExpr::create(BitPosition, getContext()));
  }
  getStreamer().emitAssignment(
      Sym, MCConstantExpr::create(AbsoluteValue, getContext()));

