ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  return false;
}

// symbol-name .VECTOR Vector-table-allocation-address
bool RL78AsmParser::parseDirectiveVector(StringRef Name) {

  MCSymbol *Sym = Parser.getContext().lookupSymbol(Name);

  SMLoc EqualLoc = Parser.getTok().getLoc();
  // Eat the .VECTOR
  Lex();

  // Parse vector table allocation address
  if (getLexer().getTok().isNot(AsmToken::Integer))
    return TokError("unexpected token in directive");

  // An even address between 0x00000 and 0x0007E can be specified as the vector
  // table allocation address.
  int64_t VectorAddress = getLexer().getTok().getIntVal();
  if (0 > VectorAddress || VectorAddress > 0x7e || VectorAddress % 2 != 0)
    return TokError("invalid vector allocation address value");

  std::string VectorSymbolName =
      ("___vector_" + Twine::utohexstr(VectorAddress) + "_").str();

  MCSymbol *VectorSym = Parser.getContext().lookupSymbol(VectorSymbolName);
  if (VectorSym)
    return TokError("Redefinition of the 0x" +
                    Twine::utohexstr(VectorAddress & 0xFE).str() +
                    " entry in the interrupt table!");

  // Eat the address value.
  Lex();
  if (!Sym)
    Sym = Parser.getContext().getOrCreateSymbol(Name);
   VectorSym = Parser.getContext().getOrCreateSymbol(VectorSymbolName);

  VectorSym->setRedefinable(false);
  getStreamer().emitAssignment(VectorSym,
                               MCSymbolRefExpr::create(Sym, getContext()));
  getStreamer().emitSymbolAttribute(VectorSym, MCSA_Global);

  return false;
}

// .LINE ["file-name",] line-number [; comment]
bool RL78AsmParser::parseDirectiveLine() {
  AsmToken Token = getLexer().getTok();

  StringRef FileName;
  int64_t LineNo;

  // Parse optional filename
  if (Token.is(AsmToken::String)) {
    FileName = Token.getString();
    Lex();
    if (getParser().check(getLexer().getTok().isNot(AsmToken::Comma),
                          getLexer().getTok().getLoc(),
                          "expected ',' after filename"))
      return true;
    Lex();
  }

  // Parse line number
  if (getLexer().getTok().isNot(AsmToken::Integer))
    return TokError("unexpected token in directive");

  LineNo = getLexer().getTok().getIntVal();
  Lex();

  // TODO: It appears that the CC-RL assembler ignores this directive, contrary
  // to LLVM's .loc. Let's also ignore it for now.

  return false;
}

// ._LINE_TOP inline_asm [; comment]
// ._LINE_END inline_asm [; comment]
bool RL78AsmParser::parseDirectiveLineTopEnd() {
  AsmToken Token = getLexer().getTok();
  // After syntax checking we ignore this directive
  // Note that we don't check for matching TOP/END pairs.
  if (Token.isNot(AsmToken::Identifier) ||
      Token.getString().compare("inline_asm") != 0)
    return TokError("unexpected token in directive");
  Lex();
  return false;
}

// .STACK symbol-name=absolute-expression [; comment]
bool RL78AsmParser::parseDirectiveStack() {

  // After syntax checking we ignore this directive
  if (getLexer().getTok().isNot(AsmToken::Identifier))
    return TokError("unexpected token in directive");
  Lex();

  if (getLexer().getTok().isNot(AsmToken::Equal))
    return TokError("unexpected token in directive");
  Lex();

  int64_t Value;
  if (getParser().parseAbsoluteExpression(Value))
    return true;

  return false;
}

bool RL78AsmParser::parseDirectiveType() {

  // No syntax checking because the CC-RL manual does not describe the
  // directive. Just eat everything till the end of the line.
  while (getLexer().getTok().isNot(AsmToken::EndOfStatement) &&
         getLexer().getTok().isNot(AsmToken::Eof))
    Lex();

  return false;
}

bool RL78AsmParser::ParseDirective(AsmToken DirectiveID) {

  SMLoc Loc = getLexer().getLoc();

  if (DirectiveID.getString().compare(".PUBLIC") == 0 ||
      DirectiveID.getString().compare(".EXTERN") == 0) {
    // TODO: add error handling
    return parseDirectiveSymbolAttribute(MCSA_Global);
  } else if (DirectiveID.getString().compare(".SECTION") == 0) {
    return ParseSectionArguments(Loc);
  } else if (DirectiveID.getString().compare(".ORG") == 0) {
    return ParseDirectiveOrg();
  } else if (DirectiveID.getString().compare(".OFFSET") == 0) {
    return ParseDirectiveOffset();
  } else if (DirectiveID.getString().compare(".DB") == 0) {
    return parseDirectiveValue(".DB", 1);
  } else if (DirectiveID.getString().compare(".DB2") == 0) {
    return parseDirectiveValue(".DB2", 2);
  } else if (DirectiveID.getString().compare(".DB4") == 0) {
    return parseDirectiveValue(".DB4", 4);
  } else if (DirectiveID.getString().compare(".DB8") == 0) {
    return parseDirectiveValue(".DB8", 8);
  } else if (DirectiveID.getString().compare(".DS") == 0) {
    return parseDSDirective();
  } else if (DirectiveID.getString().compare(".ALIGN") == 0) {
    return parseDirectiveAlign();
  }  
  /*else if (DirectiveID.getString().compare(".DBIT") == 0) {
	//TODO error check for current section = bit section
	getStreamer().EmitIntValue(0, 1);
    return false;
  }*/
  else if (DirectiveID.getString().compare(".LINE") == 0) {
    return parseDirectiveLine();
  } else if (DirectiveID.getString().lower().compare("._line_top") == 0 ||
             DirectiveID.getString().lower().compare("._line_end") == 0) {
    return parseDirectiveLineTopEnd();
  } else if (DirectiveID.getString().compare(".STACK") == 0) {
    return parseDirectiveStack();
  } else if (DirectiveID.getString().compare(".TYPE") == 0) {
    return parseDirectiveType();
  } else if (DirectiveID.getKind() == AsmToken::Identifier) {
    StringRef Tok = getLexer().getTok().getString();
    if (Tok.compare(".MACRO") == 0)
      return parseDirectiveMacro(DirectiveID.getString());
	if (Tok.compare(".SET") == 0)
      return parseDirectiveSet(DirectiveID.getString());
	if (Tok.compare(".EQU") == 0)
      return parseDirectiveEqu(DirectiveID.getString());

    if (Tok.compare(".CSEG") == 0 || Tok.compare(".BSEG") == 0 ||
        Tok.compare(".DSEG") == 0) {
      Lex();
      return parseDirectiveSeg(DirectiveID.getString(), Tok);
    }

    // section name is optional
    if (DirectiveID.getString().compare(".CSEG") == 0 ||
        DirectiveID.getString().compare(".DSEG") == 0 ||
        DirectiveID.getString().compare(".BSEG") == 0)
      return parseDirectiveSeg("", DirectiveID.getString());

    if (Tok.compare(".VECTOR") == 0)
      return parseDirectiveVector(DirectiveID.getString());

