ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  }
  return true;
}

bool RL78AsmParser::ParseInstruction(ParseInstructionInfo &Info, StringRef Name,
                                     SMLoc NameLoc, OperandVector &Operands) {

  // First verify if b_cc or s_cc.
  // If not, single mnemonic - push operand.
  if (Name.compare("sel") == 0 && getSTI().getCPU() == "RL78_S1") {

    SMLoc Loc = getLexer().getLoc();
    return Error(Loc, "Instruction not defined for S1 core type");
  }
  if ((Name.compare("mulhu") == 0 || Name.compare("mulh") == 0 ||
       Name.compare("divhu") == 0 || Name.compare("divwu") == 0 ||
       Name.compare("machu") == 0 || Name.compare("mach") == 0) &&
      (getSTI().getCPU() == "RL78_S1" || getSTI().getCPU() == "RL78_S2")) {

    SMLoc Loc = getLexer().getLoc();
    return Error(Loc, "Instruction defined only for S3 core type.");
  }
  if (!tryParseBCCorSCC(Operands, Name, NameLoc)) {
    // First operand in MCInst is instruction mnemonic.
    Operands.push_back(RL78Operand::CreateToken(Name, NameLoc));
  }

  // Read the remaining operands.
  if (getLexer().isNot(AsmToken::EndOfStatement)) {
    // Read the first operand.
    if (parseOperand(Operands, Name)) {
      SMLoc Loc = getLexer().getLoc();
      Parser.eatToEndOfStatement();
      return Error(Loc, "unexpected token in argument list");
    }

    while (getLexer().is(AsmToken::Comma)) {
      Parser.Lex(); // Eat the comma.

      // Parse and remember the operand.
      if (parseOperand(Operands, Name)) {
        SMLoc Loc = getLexer().getLoc();
        Parser.eatToEndOfStatement();
        return Error(Loc, "unexpected token in argument list");
      }
    }
  }

  if (getLexer().isNot(AsmToken::EndOfStatement)) {
    SMLoc Loc = getLexer().getLoc();
    Parser.eatToEndOfStatement();
    return Error(Loc, "unexpected token in argument list");
  }
  // Consume the EndOfStatement.
  Parser.Lex();
  return false;
}



static OperandMatchResultTy CheckAddressValueRange(StringRef Mnemonic,
                                                   OperandVector &Operands,
                                                   int64_t AddressValue,
                                                   MCContext &Context, SMLoc S,
                                                   SMLoc E) {
  const MCExpr *EVal = MCConstantExpr::create(AddressValue, Context);
  if (Mnemonic.compare("movw") != 0 && AddressValue > 0xfff1f &&
      AddressValue <= 0xfffff)
    Operands.push_back(RL78Operand::CreateSfr(EVal, S, E));
  else if (AddressValue > 0xfff1f && AddressValue <= 0xfffff &&
           AddressValue % 2 == 0)
    Operands.push_back(RL78Operand::CreateSfrp(EVal, S, E));
  else if (AddressValue >= 0xffe20 && AddressValue <= 0xfff1f)
    Operands.push_back(RL78Operand::CreateAbs8(EVal, S, E));
  else
    return MatchOperand_NoMatch;
  return MatchOperand_Success;
}

StringRef StripTempSymbolPrefix(StringRef Symbol) {
  // We are expecting names in the form of:
  // .L__$__{Symbol or RegName}__$__{Nr}
  StringRef Guard = "__$__";
  size_t Start = Symbol.find(Guard) + Guard.size();
  size_t End = Symbol.rfind(Guard);
  if (Start != StringRef::npos && End != StringRef::npos && Start != End) {
    StringRef Temp = Symbol.substr(Start, End - Start);
    return Symbol.substr(Start, End - Start);
  }

  return Symbol;
}

OperandMatchResultTy
RL78AsmParser::parseDotIncludingOperand(OperandVector &Operands,
                                        StringRef Mnemonic) {

  if (Mnemonic.compare("mov1") != 0 && Mnemonic.compare("and1") != 0 &&
      Mnemonic.compare("or1") != 0 && Mnemonic.compare("xor1") != 0 &&
      Mnemonic.compare("set1") != 0 && Mnemonic.compare("clr1") != 0 &&
      Mnemonic.compare("bt") != 0 && Mnemonic.compare("bf") != 0 &&
      Mnemonic.compare("btclr") != 0)
    return MatchOperand_NoMatch;

  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const AsmToken &Token = getLexer().getTok();

  if (Token.is(AsmToken::Identifier) &&
          ((Token.getString().compare_insensitive("cy") == 0) ||
           (Token.getString().compare_insensitive("es") == 0)) ||
      Token.is(AsmToken::LBrac))
    return MatchOperand_NoMatch;

  const MCExpr *Value;
  if (getParser().parseExpression(Value)) {
    Error(Token.getLoc(), "missing expression");
    return MatchOperand_NoMatch;
  }

  int64_t AddressValue = 0;
  MCValue AddressMCValue;
  int64_t BitPosition = -1;
  // Check if it's a symbolref to a bitpositional symbol
  if (Value->getKind() == MCExpr::SymbolRef) {
    const MCSymbol *AddressSymbol =
        Parser.getContext().lookupSymbol(Token.getString());
    MCSymbol *PositionSymbol = Parser.getContext().lookupSymbol(
        BitPositionSymbolPrefix + Token.getString());
    if (!AddressSymbol || !AddressSymbol->isVariable() ||
        !AddressSymbol->getVariableValue()->evaluateAsAbsolute(AddressValue))
      return MatchOperand_NoMatch;
    if (!PositionSymbol || !PositionSymbol->isVariable() ||
        !PositionSymbol->getVariableValue()->evaluateAsAbsolute(BitPosition))
      return MatchOperand_NoMatch;
    if (CheckAddressValueRange(Mnemonic, Operands, AddressValue, getContext(),
                               S, E) != MatchOperand_Success)
      return MatchOperand_NoMatch;
  } else {

    if (/*!HasTargetSubExpressionKind(Value, RL78MCExpr::VK_RL78_BITPOSITIONAL)
           ||*/
        !RL78MCExpr::FoldBitPositionalExpression(Value, AddressMCValue,
                                                 BitPosition, getContext()) ||
        BitPosition == -1) {
      LLVM_DEBUG(Value->dump());
      Error(Token.getLoc(), "invalid expression");
      return MatchOperand_NoMatch;
    }

    if (AddressMCValue.isAbsolute() &&
        CheckAddressValueRange(Mnemonic, Operands, AddressMCValue.getConstant(),
                               getContext(), S, E) != MatchOperand_Success) {
      LLVM_DEBUG(Value->dump());
      Error(Token.getLoc(), "invalid expression");
      return MatchOperand_NoMatch;
    } else if (!AddressMCValue.isAbsolute()) {
      unsigned RegANo, RegAKind, RegBNo, RegBKind;
      bool IsSymARegister = false;
      bool IsSymBRegister = false;
      StringRef SymAName, SymBName;
      MCSymbol *SymA, *SymB;

      if (AddressMCValue.getSymA()) {
        SymAName = StripTempSymbolPrefix(
            AddressMCValue.getSymA()->getSymbol().getName());
        IsSymARegister = matchRegisterNameByName(SymAName, RegANo, RegAKind);
        SymA = getContext().lookupSymbol(SymAName);
      }

      if (AddressMCValue.getSymB()) {
        SymBName = StripTempSymbolPrefix(
            AddressMCValue.getSymB()->getSymbol().getName());
        IsSymBRegister = matchRegisterNameByName(SymBName, RegBNo, RegBKind);
      }

      // Registers can't be used in binary expressions and can't have constant
      // adds.
      if ((IsSymARegister || IsSymBRegister) &&
          AddressMCValue.getConstant() != 0) {
        Error(Token.getLoc(), "invalid expression");
        return MatchOperand_NoMatch;
      }
      const MCExpr *SymEVal;
      if (IsSymARegister || IsSymBRegister) {
        Operands.push_back(
            RL78Operand::CreateReg(IsSymARegister ? RegANo : RegBNo,
                                   IsSymARegister ? RegAKind : RegBKind, S, E));
      } else if (AddressMCValue.getSymA() && AddressMCValue.getSymB()) {
        SymA = getContext().getOrCreateSymbol(SymAName);
        SymB = getContext().getOrCreateSymbol(SymBName);
        SymEVal = MCBinaryExpr::createAdd(
            MCSymbolRefExpr::create(SymA, getContext()),
            MCConstantExpr::create(AddressMCValue.getConstant(), getContext()),
            getContext());
        SymEVal = MCBinaryExpr::createSub(
            SymEVal, MCSymbolRefExpr::create(SymB, getContext()), getContext());

        Operands.push_back(RL78Operand::CreateAbs8(SymEVal, S, E));
      } else if (AddressMCValue.getSymA()) {
        SymA = getContext().getOrCreateSymbol(SymAName);
        SymEVal = MCBinaryExpr::createAdd(
            MCSymbolRefExpr::create(SymA, getContext()),
            MCConstantExpr::create(AddressMCValue.getConstant(), getContext()),
            getContext());
        Operands.push_back(RL78Operand::CreateAbs8(SymEVal, S, E));
      } else {
        llvm_unreachable("Unexpected MCValue");
      }
    }
  }

  const MCExpr *EVal = MCConstantExpr::create(BitPosition, getContext());
  Operands.push_back(RL78Operand::CreateImm07(EVal, S, E));
  return MatchOperand_Success;
}

