ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
OperandMatchResultTy RL78AsmParser::ParseRegister(OperandVector &Operands,
                                                  StringRef Mnemonic) {

  OperandMatchResultTy ResTy = MatchOperand_NoMatch;
  unsigned RegNo, RegKind;

  if (matchRegisterName(Parser.getTok(), RegNo, RegKind) &&
      !getLexer().peekTok().is(AsmToken::Colon)) {

    SMLoc S = Parser.getTok().getLoc();
    Parser.Lex(); // Eat the identifier token.
    SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
    Operands.push_back(RL78Operand::CreateReg(RegNo, RegKind, S, E));

    ResTy = MatchOperand_Success;
  }

  return ResTy;
}

OperandMatchResultTy RL78AsmParser::ParseOpeandRBx(OperandVector &Operands) {

  OperandMatchResultTy ResTy = MatchOperand_NoMatch;

  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const MCExpr *EVal;

  StringRef name = Parser.getTok().getString();
  if (name.compare_insensitive("rb0") == 0) {
    EVal = MCConstantExpr::create(0, getContext());
    Operands.push_back(RL78Operand::CreateSELRBx(EVal, S, E));
    ResTy = MatchOperand_Success;
    Parser.Lex();
  } else if (name.compare_insensitive("rb1") == 0) {
    EVal = MCConstantExpr::create(1, getContext());
    Operands.push_back(RL78Operand::CreateSELRBx(EVal, S, E));
    ResTy = MatchOperand_Success;
    Parser.Lex();
  } else if (name.compare_insensitive("rb2") == 0) {
    EVal = MCConstantExpr::create(2, getContext());
    Operands.push_back(RL78Operand::CreateSELRBx(EVal, S, E));
    ResTy = MatchOperand_Success;
    Parser.Lex();
  } else if (name.compare_insensitive("rb3") == 0) {
    EVal = MCConstantExpr::create(3, getContext());
    Operands.push_back(RL78Operand::CreateSELRBx(EVal, S, E));
    ResTy = MatchOperand_Success;
    Parser.Lex();
  }
  return ResTy;
}

OperandMatchResultTy
RL78AsmParser::ParseShiftIntegerOperand(OperandVector &Operands,
                                        StringRef Mnemonic) {

  OperandMatchResultTy ResTy = MatchOperand_NoMatch;

  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const MCExpr *EVal;
  if (Mnemonic.compare("shr") == 0 || Mnemonic.compare("shl") == 0 ||
      Mnemonic.compare("sar") == 0) {
    std::unique_ptr<RL78Operand> Op;
    if (!getParser().parseExpression(EVal, E)) {
      Op = RL78Operand::CreateImm17(EVal, S, E);

      Operands.push_back(std::move(Op));
      ResTy = MatchOperand_Success;
    }
  } else if (Mnemonic.compare("shrw") == 0 || Mnemonic.compare("shlw") == 0 ||
             Mnemonic.compare("sarw") == 0 || Mnemonic.compare("shrw") == 0) {

    std::unique_ptr<RL78Operand> Op;
    if (!getParser().parseExpression(EVal, E)) {
      Op = RL78Operand::CreateImm115(EVal, S, E);

      Operands.push_back(std::move(Op));
      ResTy = MatchOperand_Success;
    }
  } else if (Mnemonic.compare("ror") == 0 || Mnemonic.compare("rol") == 0 ||
             Mnemonic.compare("rorc") == 0 || Mnemonic.compare("rolc") == 0 ||
             Mnemonic.compare("rolwc") == 0 || Mnemonic.compare("rorc") == 0) {

    Operands.push_back(RL78Operand::CreateToken(Parser.getTok().getString(),
                                                Parser.getTok().getLoc()));
    Parser.Lex();
    ResTy = MatchOperand_Success;
  }
  return ResTy;
}

OperandMatchResultTy RL78AsmParser::parseOperand(OperandVector &Operands,
                                                 StringRef Mnemonic) {
  // TODO: cleanup/code duplication reduction
  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const MCExpr *Res;

  // SEL RB0 ;TODO: add s1 not check.
  if (ParseOpeandRBx(Operands) == MatchOperand_Success)
    return MatchOperand_Success;
  // Register ax, special, or r8.
  if (ParseRegister(Operands, Mnemonic) == MatchOperand_Success)
    return MatchOperand_Success;

  // Byte or word.
  if (getLexer().is(AsmToken::Hash)) {

    Parser.Lex(); // Eat the Hash token.
    SMLoc S = Parser.getTok().getLoc();
    SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
    const MCExpr *EVal;
    Parser.parseExpression(EVal, E);
    Operands.push_back(RL78Operand::CreateImm(EVal, S, E));
    return MatchOperand_Success;
  }
  if (getLexer().is(AsmToken::Dollar)) {

    AsmToken Excl = Parser.Lex();
    if (getLexer().is(AsmToken::Exclaim)) {
      Parser.Lex();
      SMLoc S = Parser.getTok().getLoc();
      SMLoc E =
          SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
      const MCExpr *EVal;
      Parser.parseExpression(EVal, E);
      if (Mnemonic.compare("call") == 0)
        Operands.push_back(RL78Operand::CreatebrtargetRel16(EVal, S, E));
      else
        Operands.push_back(RL78Operand::CreatebrtargetRel16(EVal, S, E));
      return MatchOperand_Success;

    } else {
      SMLoc S = Parser.getTok().getLoc();
      SMLoc E =
          SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
      const MCExpr *EVal;
      Parser.parseExpression(EVal, E);
      Operands.push_back(RL78Operand::CreatebrtargetRel8(EVal, S, E));
      return MatchOperand_Success;
    }
  }
  if (getLexer().is(AsmToken::Exclaim)) {
    AsmToken ExclFirst = Parser.getTok();
    AsmToken ExclSecond = Parser.Lex();
    if (getLexer().is(AsmToken::Exclaim)) {
      Parser.Lex();
      SMLoc S = Parser.getTok().getLoc();
      SMLoc E =
          SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
      const MCExpr *EVal;
      Parser.parseExpression(EVal, E);
      if (Mnemonic.compare("br") == 0) {
        Operands.push_back(RL78Operand::CreateToken(ExclFirst.getString(),
                                                    ExclFirst.getLoc()));
        Operands.push_back(RL78Operand::CreateToken(ExclSecond.getString(),
                                                    ExclSecond.getLoc()));

        Operands.push_back(RL78Operand::CreateAbs20(EVal, S, E));
      } else {
        Operands.push_back(RL78Operand::CreateToken(ExclFirst.getString(),
                                                    ExclFirst.getLoc()));
        Operands.push_back(RL78Operand::CreateToken(ExclSecond.getString(),
                                                    ExclSecond.getLoc()));

