ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
        Operands.push_back(RL78Operand::CreateAbs20(EVal, S, E));
      }
      return MatchOperand_Success;
    } else {

      SMLoc S = Parser.getTok().getLoc();
      SMLoc E =
          SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
      const MCExpr *EVal;
      StringRef checkDot = getLexer().getTok().getString();

      size_t dot = checkDot.find(".");
      if (dot != std::string::npos &&
          checkDot.substr(dot + 1, checkDot.size())
                  .find_first_not_of("0123456789") == std::string::npos &&
          (Mnemonic.compare("set1") == 0 || Mnemonic.compare("clr1") == 0)) {
        std::string before_dot = std::string(checkDot.substr(0, dot));

        int64_t value = getSymbolAliasValue(before_dot);

        if (value == 0) {
          std::stringstream ss;
          if (before_dot.find("F") != std::string::npos ||
              before_dot.find("f") != std::string::npos) {
            ss << std::hex << before_dot;
          } else {
            ss << before_dot;
          }
          ss >> value;
        }

        if (value != 0)
          EVal = MCConstantExpr::create(value, getContext());
        else {
          MCSymbol *Sym = getContext().getOrCreateSymbol(before_dot);
          MCSymbolRefExpr::VariantKind Variant = MCSymbolRefExpr::VK_None;
          EVal =
              MCSymbolRefExpr::create(Sym, Variant, getParser().getContext());
        }

        Operands.push_back(RL78Operand::CreateAbs16(EVal, S, E));

        std::string imm = std::string(checkDot.substr(dot + 1, checkDot.size()));
        const MCExpr *EVal;
        EVal = MCConstantExpr::create(std::stoi(imm), getContext());
        SMLoc S = Parser.getTok().getLoc();
        SMLoc E =
            SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
        Operands.push_back(RL78Operand::CreateImm07(EVal, S, E));
        Parser.Lex();
        return MatchOperand_Success;
      } else {
        StringRef checkDot = getLexer().getTok().getString();
        size_t dot = checkDot.find(".");
        if (dot == std::string::npos) {
          if (!Parser.parseExpression(EVal, E)) {
            MCValue AddressValue;
            int64_t BitPosition = -1;
            if (!RL78MCExpr::FoldBitPositionalExpression(
                    EVal, AddressValue, BitPosition, getContext()) ||
                BitPosition == -1) {
              Operands.push_back(RL78Operand::CreateAbs16(EVal, S, E));
            } else {
              const MCExpr *AddressExpr;
              if (AddressValue.isAbsolute()) {
                AddressExpr = MCConstantExpr::create(AddressValue.getConstant(),
                                                     getContext());
              } else if (!AddressValue.getSymB()) {
                AddressExpr = AddressValue.getSymA();
              } else {
                AddressExpr = MCBinaryExpr::createSub(AddressValue.getSymA(),
                                                      AddressValue.getSymB(),
                                                      getContext());
              }
              Operands.push_back(RL78Operand::CreateAbs16(AddressExpr, S, E));
              Operands.push_back(RL78Operand::CreateImm07(
                  MCConstantExpr::create(BitPosition, getContext()), S, E));
            }

            return MatchOperand_Success;
          }
        } else {
          // We expect set1 !addr16.imm.
          const MCExpr *EVal;

          SMLoc S = Parser.getTok().getLoc();
          SMLoc E =
              SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
          std::string before_dot = std::string(checkDot.substr(0, dot));

          int64_t value = getSymbolAliasValue(before_dot);

          if (value == 0) {
            std::stringstream ss;
            if (before_dot.find("F") != std::string::npos ||
                before_dot.find("f") != std::string::npos) {
              ss << std::hex << before_dot;
            } else
              ss << before_dot;
            ss >> value;
          }
          if (value != 0) {
            EVal = MCConstantExpr::create(value, getContext());
          } else {
            MCSymbol *Sym = getContext().getOrCreateSymbol(before_dot);
            MCSymbolRefExpr::VariantKind Variant = MCSymbolRefExpr::VK_None;
            EVal =
                MCSymbolRefExpr::create(Sym, Variant, getParser().getContext());
          }

          Operands.push_back(RL78Operand::CreateAbs16(EVal, S, E));

          std::string imm = std::string(checkDot.substr(dot + 1, checkDot.size()));
          EVal = MCConstantExpr::create(std::stoi(imm), getContext());
          S = Parser.getTok().getLoc();
          E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
          Operands.push_back(RL78Operand::CreateImm07(EVal, S, E));
          Parser.Lex();

          return MatchOperand_Success;
        }
      }
    }
  }

  if (parseDotIncludingOperand(Operands, Mnemonic) == MatchOperand_Success)
    return MatchOperand_Success;

  // ES:!addr16.
  // ES : [DE].
  // ES : [DE + byte].
  // ES : [HL] ES : word[B].
  // ES : word[BC].
  if (parseEsRegRegAddrAndDotOperand(Operands, Mnemonic) ==
          MatchOperand_Success &&
      (getLexer().getTok().getString().find(".") == std::string::npos ||
       getLexer().getTok().getString().find(";") != std::string::npos))
    return MatchOperand_Success;

  if (ParseShiftIntegerOperand(Operands, Mnemonic) == MatchOperand_Success)
    return MatchOperand_Success;

  // word[bc].
  // word[c].
  // word[b].
  if (parseRegOffsetAddrOperand(Operands, Mnemonic) == MatchOperand_Success &&
      (getLexer().getTok().getString().find(".") == std::string::npos ||
       getLexer().getTok().getString().find(";") != std::string::npos))
    return MatchOperand_Success;

  if (RegBrackets(Operands, Mnemonic) == MatchOperand_Success &&
      (getLexer().getTok().getString().find(".") == std::string::npos ||
       getLexer().getTok().getString().find(";") != std::string::npos))
    return MatchOperand_Success;

