ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
  StringRef checkDot = getLexer().getTok().getString();
  size_t dot = checkDot.find(".");
  if (dot == std::string::npos) {
    Parser.parseExpression(Res, E);
    if (Res) {
      int64_t value = 0;
      if (Res->getKind() == Res->Constant)
        value = ((dyn_cast<MCConstantExpr>(Res))->getValue());

      LLVM_DEBUG(dbgs() << "Value is :" << value);
      if (Mnemonic.compare("movw") != 0 && value >= 0xfff1f && value <= 0xfffff)
        Operands.push_back(RL78Operand::CreateSfr(Res, S, E));
      else if (value >= 0xfff1f && value <= 0xfffff && value % 2 == 0)
        Operands.push_back(RL78Operand::CreateSfrp(Res, S, E));
      else if (value >= 0xffe20 && value <= 0xfff1f)
        Operands.push_back(RL78Operand::CreateAbs8(Res, S, E));
      else
        Operands.push_back(RL78Operand::CreateAbs8(Res, S, E));
    }
  }

  // Handle bit position part of [HL].5 or ES:[HL].6 for example
  AsmToken Token = getLexer().getTok();
  StringRef TokenString = Token.getString();
  dot = TokenString.find('.');
  int64_t BitPositionValue;
  if (dot == 0) {
    // TODO: eliminate code duplication
    if (Token.is(AsmToken::Real)) {
      // See if we have (0xf230+4).[0-7]
      if (TokenString.size() != 2 || TokenString[1] < '0' ||
          TokenString[1] > '7')
        return MatchOperand_NoMatch;
      BitPositionValue = TokenString[1] - '0';

    } else if (Token.is(AsmToken::Identifier)) {
      // Or (0xf230+4).SYM
      const MCSymbol *BitSym = getContext().lookupSymbol(
          TokenString.substr(1, TokenString.size() - 2));
      if (!BitSym || !BitSym->isVariable() ||
          !BitSym->getVariableValue()->evaluateAsAbsolute(BitPositionValue))
        return MatchOperand_NoMatch;
    } else {
      return MatchOperand_NoMatch;
    }
    const MCExpr *BitPosExpr =
        MCConstantExpr::create(BitPositionValue, getContext());
    Parser.Lex();
    SMLoc S = Parser.getTok().getLoc();
    SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
    Operands.push_back(RL78Operand::CreateImm07(BitPosExpr, S, E));
    return MatchOperand_Success;
  }

  return MatchOperand_Success;
}

// Unused.
OperandMatchResultTy RL78AsmParser::parseMEMOperand(OperandVector &Operands) {
  return MatchOperand_NoMatch;
}

// Unused.
OperandMatchResultTy
RL78AsmParser::parseStackSlotOperand(OperandVector &Operands) {
  return MatchOperand_NoMatch;
}

OperandMatchResultTy
RL78AsmParser::parseRegOffsetAddrOperand(OperandVector &Operands,
                                         StringRef Mnemonic) {

  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const MCExpr *Res = nullptr;
  unsigned RegNo, RegKind;
  // Due to the fact that we can actually have an expression here and we might
  // parse it and lose it we need to check for dot.
  StringRef checkDot = getLexer().getTok().getString();
  size_t dot = checkDot.find(".");
  // In case we have a dot we stop as we will parse this later.
  if (getLexer().is(AsmToken::LBrac) || dot != std::string::npos)
    return MatchOperand_NoMatch;

  // Needed for word[bc].
  if (!getParser().parseExpression(Res, E)) {
    // A LBrac is what we actually want, but because we already parsed the
    // expression we also need to take care of the else case.
    if (getLexer().is(AsmToken::LBrac)) {

      Parser.Lex(); // Eat the '['.

      StringRef name = Parser.getTok().getString();
      if ((name.compare_insensitive("bc") == 0 || name.compare_insensitive("b") == 0 ||
           name.compare_insensitive("c") == 0) &&
          Res != nullptr) {
        if (!matchRegisterName(Parser.getTok(), RegNo, RegKind))
          return MatchOperand_NoMatch;
        Parser.Lex(); // Eat the identifier token.

        if (getLexer().is(AsmToken::RBrac)) {
          if (name.compare_insensitive("bc") == 0)
            Operands.push_back(
                RL78Operand::CreateRegOffsetAddr(RegNo, RegKind, Res, S, E));
          else
            Operands.push_back(RL78Operand::CreateRegBorCOffsetAddr(
                RegNo, RegKind, Res, S, E));

          Parser.Lex(); // Eat the ']'.
          return MatchOperand_Success;
        }
      }
      return MatchOperand_NoMatch;
    } else {
      // We need this here because we already parsed the expression.
      if (Res) {
        int64_t value = 0;
        if (Res->getKind() == Res->Constant)
          value = ((dyn_cast<MCConstantExpr>(Res))->getValue());

        LLVM_DEBUG(dbgs() << "Value is :" << value);
        if (Mnemonic.compare("movw") != 0 && value >= 0xfff1f &&
            value <= 0xfffff)
          Operands.push_back(RL78Operand::CreateSfr(Res, S, E));
        else if (value >= 0xfff1f && value <= 0xfffff && value % 2 == 0)
          Operands.push_back(RL78Operand::CreateSfrp(Res, S, E));
        else if (value >= 0xffe20 && value <= 0xfff1f)
          Operands.push_back(RL78Operand::CreateAbs8(Res, S, E));
        else
          Operands.push_back(RL78Operand::CreateAbs8(Res, S, E));
        return MatchOperand_Success;
      }
    }
    return MatchOperand_NoMatch;
  }
  return MatchOperand_NoMatch;
}

OperandMatchResultTy
RL78AsmParser::parseRegOffsetAddrOperand(OperandVector &Operands) {
  return MatchOperand_NoMatch;
}
OperandMatchResultTy
RL78AsmParser::parseRegRegAddrOperand(OperandVector &Operands) {
  return MatchOperand_NoMatch;
}
OperandMatchResultTy
RL78AsmParser::parseEsRegRegRegOperand(OperandVector &Operands) {
  return MatchOperand_NoMatch;
}
OperandMatchResultTy
RL78AsmParser::parseEsRegRegAddrOperand(OperandVector &Operands) {
  return MatchOperand_NoMatch;
}
// ES:!addr16.
// ES : [DE].
// ES : [DE + byte].
// ES : [HL] ES : word[B].
// ES : word[BC].
OperandMatchResultTy
RL78AsmParser::parseEsRegRegAddrAndDotOperand(OperandVector &Operands,
                                              StringRef Mnemonic) {

  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const MCExpr *Res = nullptr;
  unsigned RegESNo, RegESKind, RegNo, RegKind;

  if ((getLexer().getTok().getString() == "es" ||
       getLexer().getTok().getString() == "ES") &&
      getLexer().peekTok().is(AsmToken::Colon)) {

    if (!matchRegisterName(Parser.getTok(), RegESNo, RegESKind))
      return MatchOperand_NoMatch;

