ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
    Parser.Lex();

    if (getLexer().is(AsmToken::Colon))
      Parser.Lex(); // Eat the ':'.
    else
      return MatchOperand_NoMatch;

    if (getLexer().is(AsmToken::Exclaim)) {
      Parser.Lex(); // Eat the '!'.

      StringRef name = Parser.getTok().getString();
      size_t dot = name.find(".");
      if (dot != std::string::npos &&
          name.substr(dot + 1, name.size()).find_first_not_of("0123456789") ==
              std::string::npos &&
          (Mnemonic.compare("set1") == 0 || Mnemonic.compare("clr1") == 0)) {

        std::string before_dot = std::string(name.substr(0, dot));
        StringRef sfrx = before_dot;
        int64_t value = getSymbolAliasValue(before_dot);

        if (value == 0) {
          std::stringstream ss;
          if (before_dot.find("F") != std::string::npos ||
              before_dot.find("f") != std::string::npos) {
            ss << std::hex << before_dot;
          } else {
            ss << before_dot;
          }
          ss >> value;
        }

        if (value != 0)
          Res = MCConstantExpr::create(value, getContext());
        else {
          MCSymbol *Sym = getContext().getOrCreateSymbol(before_dot);
          MCSymbolRefExpr::VariantKind Variant = MCSymbolRefExpr::VK_None;
          Res = MCSymbolRefExpr::create(Sym, Variant, getParser().getContext());
        }

        Operands.push_back(
            RL78Operand::CreateEsAddr16(RegESNo, RegESKind, Res, S, E));

        std::string imm = std::string(name.substr(dot + 1, name.size()));
        const MCExpr *EVal;
        EVal = MCConstantExpr::create(std::stoi(imm), getContext());
        SMLoc S = Parser.getTok().getLoc();
        SMLoc E =
            SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
        Operands.push_back(RL78Operand::CreateImm07(EVal, S, E));
        Parser.Lex(); // Eat the '!'.
        return MatchOperand_Success;

      }

      else {

        if (!getParser().parseExpression(Res, E)) {
          MCValue AddressValue;
          int64_t BitPosition = -1;
          if (!RL78MCExpr::FoldBitPositionalExpression(
                  Res, AddressValue, BitPosition, getContext()) ||
              BitPosition == -1) {
            Operands.push_back(
                RL78Operand::CreateEsAddr16(RegESNo, RegESKind, Res, S, E));
          } else {
            const MCExpr *AddressExpr;
            if (AddressValue.isAbsolute()) {
              AddressExpr = MCConstantExpr::create(AddressValue.getConstant(),
                                                   getContext());
            } else if (!AddressValue.getSymB()) {
              AddressExpr = AddressValue.getSymA();
            } else {
              AddressExpr = MCBinaryExpr::createSub(
                  AddressValue.getSymA(), AddressValue.getSymB(), getContext());
            }
            Operands.push_back(RL78Operand::CreateEsAddr16(RegESNo, RegESKind,
                                                           AddressExpr, S, E));
            Operands.push_back(RL78Operand::CreateImm07(
                MCConstantExpr::create(BitPosition, getContext()), S, E));
          }
          return MatchOperand_Success;
        }
      }

    } else if (getLexer().is(AsmToken::LBrac)) {
      Parser.Lex();

      if (!matchRegisterName(Parser.getTok(), RegNo, RegKind))
        return MatchOperand_NoMatch;
      Parser.Lex();

      if (getLexer().is(AsmToken::RBrac)) {
        AsmToken a = getLexer().peekTok();
        size_t dot = a.getString().find(".");
        if (dot == std::string::npos) {

          Res = MCConstantExpr::create(0, getContext());

          Operands.push_back(RL78Operand::CreateEsRegRegAddr(
              RegESNo, RegESKind, RegNo, RegKind, Res, S, E));

          Parser.Lex(); // Eat the ']'.
          return MatchOperand_Success;
        } else {
          Parser.Lex(); // Eat the ']'.

          Operands.push_back(RL78Operand::CreateEsHlRegAddr(
              RegESNo, RegESKind, RegNo, RegKind, S, E));
          return MatchOperand_Success;
        }
      } else if (getLexer().is(AsmToken::Plus)) {
        Parser.Lex(); // Eat the '+'
        unsigned Reg, Kind;

        if (matchRegisterName(Parser.getTok(), Reg, Kind)) {

          Operands.push_back(RL78Operand::CreateEsRegRegReg(
              RegESNo, RegESKind, RegNo, RegKind, Reg, Kind, S, E));

          Parser.Lex();
          if (getLexer().is(AsmToken::RBrac)) {
            Parser.Lex(); // Eat the ']'.
            return MatchOperand_Success;
          }
        } else if (!getParser().parseExpression(Res, E)) {

          Operands.push_back(RL78Operand::CreateEsRegRegAddr(
              RegESNo, RegESKind, RegNo, RegKind, Res, S, E));

          if (getLexer().is(AsmToken::RBrac)) {
            Parser.Lex(); // Eat the ']'.
            return MatchOperand_Success;
          }
        }
      }
    } else {
      if (!getParser().parseExpression(Res, E)) {
        if (getLexer().is(AsmToken::LBrac)) {
          Parser.Lex();
          if (!matchRegisterName(Parser.getTok(), RegNo, RegKind))
            return MatchOperand_NoMatch;
          Parser.Lex();
          if (getLexer().is(AsmToken::RBrac)) {
            if (RegNo == RL78::RP2)
              Operands.push_back(RL78Operand::CreateEsRegRegAddr(
                  RegESNo, RegESKind, RegNo, RegKind, Res, S, E));
            else
              Operands.push_back(RL78Operand::CreateEsRegBorCRegAddr(
                  RegESNo, RegESKind, RegNo, RegKind, Res, S, E));

            Parser.Lex(); // Eat the ']'.
            return MatchOperand_Success;

          } else
            return MatchOperand_Success;
        }
      }
    }
  }
  return MatchOperand_NoMatch;
}

OperandMatchResultTy RL78AsmParser::RegBrackets(OperandVector &Operands,
                                                StringRef Mnemonic) {

  OperandMatchResultTy ResTy = MatchOperand_NoMatch;

  SMLoc S = Parser.getTok().getLoc();
  SMLoc E = SMLoc::getFromPointer(Parser.getTok().getLoc().getPointer() - 1);
  const MCExpr *Res;
  if (Mnemonic.compare("callt") == 0) {

