ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
    if (getLexer().is(AsmToken::LBrac)) {
      Parser.Lex(); // Eat the '[' token.

      if (!getParser().parseExpression(Res, E)) {
        Operands.push_back(RL78Operand::CreateAbs5(Res, S, E));
        ResTy = MatchOperand_Success;
      }
      if (getLexer().is(AsmToken::RBrac)) {
        Parser.Lex();
        return ResTy;
      }
    }
  }
  if (getLexer().is(AsmToken::LBrac)) {
    unsigned Reg1No, Reg1Kind;

    Parser.Lex(); // Eat the '[' token.

    if (!matchRegisterName(Parser.getTok(), Reg1No, Reg1Kind))
      return MatchOperand_NoMatch;

    Parser.Lex();

    if (getLexer().is(AsmToken::RBrac) &&
        getLexer().peekTok(true).getString().find(".") != std::string::npos &&
        Reg1No == RL78::RP6) {

      Operands.push_back(RL78Operand::CreateHLAddr(Reg1No, Reg1Kind, S, E));
      Parser.Lex(); // Eat the ']' token.

      ResTy = MatchOperand_Success;
    } else if (getLexer().is(AsmToken::RBrac)) {

      Res = MCConstantExpr::create(0, getContext());

      if (Reg1No == RL78::SPreg)
        Operands.push_back(
            RL78Operand::CreateSTACKSlotNo(Reg1No, Reg1Kind, Res, S, E));
      else
        Operands.push_back(
            RL78Operand::CreateRegOffsetAddr(Reg1No, Reg1Kind, Res, S, E));

      Parser.Lex(); // Eat the ']'.
      return MatchOperand_Success;

    } else if (getLexer().is(AsmToken::Plus)) {
      Parser.Lex(); // Eat the '+'.

      unsigned Reg2No, Reg2Kind;
      if (matchRegisterName(Parser.getTok(), Reg2No, Reg2Kind)) {

        Operands.push_back(RL78Operand::CreateRegRegAddr(
            Reg1No, Reg1Kind, Reg2No, Reg2Kind, S, E));
        Parser.Lex();
        ResTy = MatchOperand_Success;
      } else if (!getParser().parseExpression(Res, E)) {

        if (Reg1No == RL78::SPreg) {

          Operands.push_back(
              RL78Operand::CreateSTACKSlotNo(Reg1No, Reg1Kind, Res, S, E));
        } else {
          Operands.push_back(
              RL78Operand::CreateRegOffsetAddr(Reg1No, Reg1Kind, Res, S, E));
        }

        Parser.Lex();
        ResTy = MatchOperand_Success;
      }
    }

    if (getLexer().is(AsmToken::RBrac)) {

      Parser.Lex();
      return ResTy;
    }
  }

  return ResTy;
}

bool RL78AsmParser::matchRegisterName(const AsmToken &Tok, unsigned &RegNo,
                                      unsigned &RegKind) {
  RegNo = 0;
  RegKind = RL78Operand::rk_None;
  StringRef name = Tok.getString();

  return matchRegisterNameByName(name, RegNo, RegKind);
}

bool RL78AsmParser::matchRegisterNameByName(StringRef name, unsigned &RegNo,
                                            unsigned &RegKind) {
  RegNo = 0;
  RegKind = RL78Operand::rk_None;
  // Bank 0 registers:
  // X, A, C, B, E, D, L, H.

  if (name.compare_insensitive("x") == 0) {
    RegNo = RL78::R0;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("a") == 0) {
    RegNo = RL78::R1;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("c") == 0) {
    RegNo = RL78::R2;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("b") == 0) {
    RegNo = RL78::R3;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("e") == 0) {
    RegNo = RL78::R4;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("d") == 0) {
    RegNo = RL78::R5;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("l") == 0) {
    RegNo = RL78::R6;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("h") == 0) {
    RegNo = RL78::R7;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("ax") == 0) {
    RegNo = RL78::RP0;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("bc") == 0) {
    RegNo = RL78::RP2;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("de") == 0) {
    RegNo = RL78::RP4;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("hl") == 0) {
    RegNo = RL78::RP6;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("es") == 0) {
    RegNo = RL78::ES;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("cs") == 0) {
    RegNo = RL78::CS;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("sp") == 0) {
    RegNo = RL78::SPreg;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("cy") == 0) {
    RegNo = RL78::CY;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("psw") == 0) {
    RegNo = RL78::PSW;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("pmc") == 0) {
    RegNo = RL78::PMC;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("mem") == 0) {
    RegNo = RL78::MEM;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("spl") == 0) {
    RegNo = RL78::SPL;
    RegKind = RL78Operand::rk_Reg;
    return true;
  } else if (name.compare_insensitive("sph") == 0) {
    RegNo = RL78::SPH;
    RegKind = RL78Operand::rk_Reg;
    return true;
  }

  return searchSymbolAlias(name, RegNo, RegKind);
}

// Determine if an expression contains a reference to the symbol
// "_GLOBAL_OFFSET_TABLE_".
static bool hasGOTReference(const MCExpr *Expr) {
  switch (Expr->getKind()) {
  case MCExpr::Target:
    if (const RL78MCExpr *SE = dyn_cast<RL78MCExpr>(Expr))
      return hasGOTReference(SE->getSubExpr());
    break;

  case MCExpr::Constant:
    break;

  case MCExpr::Binary: {
    const MCBinaryExpr *BE = cast<MCBinaryExpr>(Expr);
    return hasGOTReference(BE->getLHS()) || hasGOTReference(BE->getRHS());
  }

  case MCExpr::SymbolRef: {
    const MCSymbolRefExpr &SymRef = *cast<MCSymbolRefExpr>(Expr);
    return (SymRef.getSymbol().getName() == "_GLOBAL_OFFSET_TABLE_");
  }

  case MCExpr::Unary:
    return hasGOTReference(cast<MCUnaryExpr>(Expr)->getSubExpr());
  }
  return false;
}

