ksekimoto/llvm-project/llvm/lib/Target/RL78/AsmParser/RL78AsmParser.cpp
bool RL78AsmParser::ParseRegister(unsigned &RegNo, SMLoc &StartLoc,
                                  SMLoc &EndLoc) {
  const AsmToken &Tok = Parser.getTok();
  StartLoc = Tok.getLoc();
  EndLoc = Tok.getEndLoc();
  RegNo = 0;
  unsigned regKind = RL78Operand::rk_None;
  if (matchRegisterName(Tok, RegNo, regKind)) {
    Parser.Lex();
    return false;
  }

  return Error(StartLoc, "invalid register name");
}

OperandMatchResultTy RL78AsmParser::tryParseRegister(unsigned &RegNo,
                                                    SMLoc &StartLoc,
                                                    SMLoc &EndLoc) {
  const AsmToken &Tok = getParser().getTok();
  StartLoc = Tok.getLoc();
  EndLoc = Tok.getEndLoc();
  RegNo = 0;
  int64_t IntVal;
  unsigned regKind = RL78Operand::rk_None;
  if (matchRegisterName(Tok, RegNo, regKind))
    return MatchOperand_NoMatch;
  return MatchOperand_Success;
}

extern "C" void LLVMInitializeRL78AsmParser() {
  RegisterMCAsmParser<RL78AsmParser> A(getTheRL78Target());
}

#define GET_REGISTER_MATCHER
#define GET_MATCHER_IMPLEMENTATION
#include "RL78GenAsmMatcher.inc"

unsigned RL78AsmParser::validateTargetOperandClass(MCParsedAsmOperand &GOp,
                                                   unsigned Kind) {
  return Match_InvalidOperand;
}
bool RL78AsmParser::searchSymbolAlias(StringRef name, unsigned &RegNo,
                                      unsigned &RegKind) {
    MCSymbol *Sym = getContext().lookupSymbol(name);
    if (!Sym)
      return false;
    if (Sym->isVariable()) {
      const MCExpr *Expr = Sym->getVariableValue();
      if (Expr->getKind() == MCExpr::SymbolRef) {
        const MCSymbolRefExpr *Ref = static_cast<const MCSymbolRefExpr *>(Expr);
        StringRef DefSymbol = Ref->getSymbol().getName();

        LLVM_DEBUG(dbgs() << "Alias for register\n");
        if (matchRegisterNameByName(DefSymbol, RegNo, RegKind))
          return true;
      }
    } else if (Sym->isUnset())
      return false; 
  return false;
}

int64_t RL78AsmParser::getSymbolAliasValue(StringRef name) {
  int64_t DefSymbol = 0;

  MCSymbol *Sym = getContext().lookupSymbol(name);
  if (!Sym)
    return DefSymbol;
  if (Sym->isVariable()) {
    const MCExpr *Expr = Sym->getVariableValue();
    if (Expr->getKind() == MCExpr::Constant) {
      const MCConstantExpr *Ref = static_cast<const MCConstantExpr *>(Expr);
      DefSymbol = Ref->getValue();
    }
  }
  return DefSymbol;
}

const MCExpr *RL78AsmParser::createTargetUnaryExpr(
    const MCExpr *E, AsmToken::TokenKind OperatorToken, MCContext &Ctx) {
  switch (OperatorToken) {
  default:
    llvm_unreachable("Unknown token");
    return nullptr;
  case AsmToken::High:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_HIGH, E, Ctx);
  case AsmToken::Low:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_LOW, E, Ctx);
  case AsmToken::HighW:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_HIGHW, E, Ctx);
  case AsmToken::LowW:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_LOWW, E, Ctx);
  case AsmToken::MirHW:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_MIRHW, E, Ctx);
  case AsmToken::MirLW:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_MIRLW, E, Ctx);
  case AsmToken::SMRLW:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_SMRLW, E, Ctx);
  case AsmToken::StartOf:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_STARTOF, E, Ctx);
  case AsmToken::SizeOf:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_SIZEOF, E, Ctx);
  case AsmToken::BitPosition:
    return RL78MCExpr::create(RL78MCExpr::VK_RL78_BITPOSITIONAL, E, Ctx);
  }
}
